<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetPageProperty("TITLE", "Правила оплаты на сайте");
$APPLICATION->SetPageProperty("description", "Правила оплаты на сайте");
$APPLICATION->SetTitle("Правила оплаты на сайте");
?><div class="page page--nohero">
	<div class="container">
		 <?$APPLICATION->IncludeComponent(
	"bitrix:breadcrumb",
	"main_breadcrumbs",
	Array(
		"PATH" => "",
		"SITE_ID" => "s1",
		"START_FROM" => "0"
	)
);?>
		<h1 class="title title-margin"><?=$APPLICATION->ShowTitle(false)?></h1>
		<p class="content">
		</p>
		<p>
 <b>1. Реквизиты предприятия</b>
		</p>
		 ООО «АН «ФСК Северо-Запад»<br>
		 ИНН 7813627626 / ОГРН 11187847371095.<br>
		 Юридический адрес: 197198, г. Санкт-Петербург, Большой пр-кт П. С., д. 48, лит. А, оф. 106<br>
		 Тел./факс: +7-812-703-55-55<br>
 <br>
		 Фактический адрес: 197198, г. Санкт-Петербург, Большой пр-кт П. С., д. 48, лит. А, оф. 106<br>
		 Электронная почта: <a href="mailto:office@fsknw.ru">office@fsknw.ru</a><br>
		 Телефоны: +7-812-703-55-55<br>
 <br>
 <br>
 <b>2. Описание процесса оплаты банковской картой<br>
 </b>Для выбора оплаты товара с помощью банковской карты на соответствующей странице сайта необходимо нажать кнопку «Оплата».<br>
 <br>
		 Оплата происходит через авторизационный сервер Процессингового центра Банка с использованием Банковских кредитных карт следующих платежных систем:<br>
		 VISA International&nbsp;<br>
		 MasterCard World Wide<br>
 <br>
 <b>Описание процесса передачи данных</b><br>
		 Для оплаты покупки Вы будете перенаправлены на платежный шлюз ПАО "Сбербанк России" для ввода реквизитов Вашей карты. Пожалуйста, приготовьте Вашу пластиковую карту заранее. Соединение с платежным шлюзом и передача информации осуществляется в защищенном режиме с использованием протокола шифрования SSL.<br>
		 &nbsp;<br>
		 В случае если Ваш банк поддерживает технологию безопасного проведения интернет-платежей Verified By Visa или MasterCard Secure Code для проведения платежа также может потребоваться ввод специального пароля. Способы и возможность получения паролей для совершения интернет-платежей Вы можете уточнить в банке, выпустившем карту.<br>
 <br>
		 Настоящий сайт поддерживает 256-битное шифрование. Конфиденциальность сообщаемой персональной информации обеспечивается ПАО "Сбербанк России". Введенная информация не будет предоставлена третьим лицам за исключением случаев, предусмотренных законодательством РФ. Проведение платежей по банковским картам осуществляется в строгом соответствии с требованиями платежных систем Visa Int. и MasterCard Europe Sprl.<br>
 <br>
 <b>Описание процессa оплаты</b><br>
		 При выборе формы оплаты с помощью пластиковой карты проведение платежа по заказу производится непосредственно после его оформления. После завершения оформления заказа в нашем магазине, Вы должны будете нажать на кнопку «Оплата банковской картой», при этом система переключит Вас на страницу авторизационного сервера, где Вам будет предложено ввести данные пластиковой карты, инициировать ее авторизацию, после чего вернуться в наш магазин кнопкой "Вернуться в магазин". После того, как Вы возвращаетесь в наш магазин, система уведомит Вас о результатах авторизации. В случае подтверждения авторизации Ваш заказ будет автоматически выполняться в соответствии с заданными Вами условиями. В случае отказа в авторизации карты Вы сможете повторить процедуру оплаты.<br>
 <br>
 <b>При аннулировании заказа</b><br>
		 Порядок аннулирования заказа регламентируется соответствующей Офертой, с которой пользователь соглашается при оплате.<br>
		 &nbsp;<br>
 <b>Оплата по банковским картам VISA</b><br>
		 К оплате принимаются все виды платежных карточек VISA, за исключением Visa Electron. В большинстве случаев карта Visa Electron не применима для оплаты через интернет, за исключением карт, выпущенных отдельными банками. О возможность оплаты картой Visa Electron вам нужно выяснять у банка-эмитента вашей карты.<br>
 <img width="319" alt="Visa.jpg" src="/upload/medialibrary/61c/61ccaf471559b6608b8d82b410198e7a.jpg" height="66" title="Visa.jpg"><br>
 <br>
 <b>Оплата по кредитным картам MasterCard</b><br>
		 На сайте к оплате принимаются все виды MasterCard.<br>
 <img width="542" alt="Master.png" src="/upload/medialibrary/33b/33b060d69e195373991858d4a7d4ecac.png" height="64" title="Master.png"><br>
 <br>
 <br>
 <b>Что нужно знать:</b><br>
		 1. номер вашей кредитной карты;<br>
		 2. cрок окончания действия вашей кредитной карты, месяц/год;<br>
		 3. CVV код для карт Visa / CVC код для Master Card: 3 последние цифры на полосе для подписи на обороте карты.<br>
 <img width="258" alt="CVV.png" src="/upload/medialibrary/2d6/2d63f3a67cb96613767db0a03e0dbe5b.png" height="123" title="CVV.png"><br>
 <br>
		<p>
			 Если на вашей карте код CVC / CVV отсутствует, то, возможно, карта не пригодна для CNP транзакций (т.е. таких транзакций, при которых сама карта не присутствует, а используются её реквизиты), и вам следует обратиться в банк для получения подробной информации.&nbsp;
		</p>
		<p><b>3. Описание возврата товара, денежных средств.</b><br>
Возврат денежных средств осуществляется на условиях и основаниях договора оферты, принимаемой пользователем до момента осуществления оплаты, а также в соответствии с действующим законодательством.</p>
		<p style="text-align: center;">
		</p>
		<p>
		</p>
	</div>
	 <!-- /.container-->
</div>
 <br><?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>