<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetPageProperty("TITLE", "Политика конфиденциальности");
$APPLICATION->SetPageProperty("keywords", "Политика конфиденциальности");
$APPLICATION->SetPageProperty("description", "Политика конфиденциальности");
$APPLICATION->SetTitle("Политика конфиденциальности");
?>
    <div class="page page--nohero">
        <div class="container">
            <?$APPLICATION->IncludeComponent("bitrix:breadcrumb", "main_breadcrumbs", Array(
                "PATH" => "",	// Путь, для которого будет построена навигационная цепочка (по умолчанию, текущий путь)
                "SITE_ID" => "s1",	// Cайт (устанавливается в случае многосайтовой версии, когда DOCUMENT_ROOT у сайтов разный)
                "START_FROM" => "0",	// Номер пункта, начиная с которого будет построена навигационная цепочка
            ),
                false
            );?>
            <h1 class="title title-margin"><?=$APPLICATION->ShowTitle(false)?></h1>
            <div class="content">
<p>
 <b>1. ОСНОВНЫЕ ПОНЯТИЯ</b>
</p>
 Сайт – <a href="https://fsknw.ru/">fsknw.ru</a>, расположенный в сети Интернет по адресу: <a href="https://fsknw.ru/">fsknw.ru</a>.<br>
 Администрация Сайта –  ООО «ФСК «Лидер Северо-Запад», <a href="http://fsknw.ru/contacts/">контакты</a>.<br>
 Пользователь – физическое или юридическое лицо, разместившее свою персональную информацию посредством Формы обратной связи на сайте с последующей целью передачи данных  Администрации Сайта.<br>
 Форма обратной связи – специальная форма, где Пользователь размещает свою персональную информацию с целью передачи данных Администрации Сайта.<br>
 <br>
<p>
 <b>2. ОБЩИЕ ПОЛОЖЕНИЯ</b>
</p>
 2.1. Настоящая Политика конфиденциальности является официальным типовым документом Администрации Сайта и определяет порядок обработки и защиты информации о физических и юридических лицах, использующих Форму обратной связи на Сайте.<br>
 2.2. Целью настоящей Политики конфиденциальности является обеспечение надлежащей защиты информации о Пользователе, в т.ч. его персональных данных от несанкционированного доступа и разглашения.<br>
 2.3. Отношения, связанные со сбором, хранением, распространением и защитой информации о пользователях регулируются настоящей Политикой конфиденциальности и действующим законодательством Российской Федерации.<br>
 2.4. Действующая редакция Политики конфиденциальности, является публичным документом, разработана Администрацией Сайта и доступна любому Пользователю сети Интернет при переходе по гипертекстовой ссылке «Политика конфиденциальности».<br>
 2.5. Администрация Сайта вправе вносить изменения в настоящую Политику конфиденциальности.<br>
 2.6. При внесении изменений в Политику конфиденциальности, Администрация Сайта уведомляет об этом Пользователя путём размещения новой редакции Политики конфиденциальности на Сайте <a href="https://fsknw.ru/privacy-policy/">https://fsknw.ru/privacy-policy/</a>.<br>
 2.7. При размещении новой редакции Политики конфиденциальности на Сайте, предыдущая редакция хранятся в архиве документации Администрации Сайта.<br>
 2.8. Используя Форму обратной связи, Пользователь выражает свое согласие с условиями настоящей Политики конфиденциальности.<br>
 2.9. Администрация Сайта не проверяет достоверность получаемой (собираемой) информации о Пользователе.<br>
 <br>
<p>
 <b>3. УСЛОВИЯ И ЦЕЛИ СБОРА И ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ ПОЛЬЗОВАТЕЛЕЙ</b>
</p>
 3.1. Персональные данные Пользователя такие как: имя, фамилия, отчество, e-mail, телефон, skype и др., передаются Пользователем  Администрации Сайта с согласия Пользователя.  <br>
 3.2. Передача персональных данных Пользователем Администрации Сайта, через Форму обратной связи  означает согласие Пользователя на передачу его персональных данных.<br>
 3.3. Администрация Сайта осуществляет обработку информации о Пользователе, в т.ч. его персональных данных, таких как: имя, фамилия, отчество, e-mail, телефон, skype и др., а также дополнительной информации о Пользователе, предоставляемой им по своему желанию: организация, город, должность и др. в целях выполнения обязательств перед Пользователем Сайта.<br>
 3.4. Обработка персональных данных осуществляется на основе принципов:<br>
 а) законности целей и способов обработки персональных данных и добросовестности;<br>
 б) соответствия целей обработки персональных данных целям, заранее определенным и заявленным при сборе персональных данных;<br>
 в) соответствия объёма и характера обрабатываемых персональных данных способам обработки персональных данных и целям обработки персональных данных;<br>
 г) недопустимости объединения созданных для несовместимых между собой целей баз данных, содержащих персональные данные.<br>
 3.5. Администрация Сайта осуществляет обработку персональных данных Пользователя с его согласия в целях оказания услуг/продажи товаров, предлагаемых на Сайте.<br>
 <br>
<p>
 <b>4. ХРАНЕНИЕ И ИСПОЛЬЗОВАНИЕ ПЕРСОНАЛЬНЫХ ДАННЫХ</b>
</p>
 Персональные данные Пользователя хранятся исключительно на электронных носителях и используются строго по назначению, оговоренному в п.3 настоящей Политики конфиденциальности.<br>
 <br>
<p>
 <b>5. ПЕРЕДАЧА ПЕРСОНАЛЬНЫХ ДАННЫХ</b>
</p>
 5.1. Персональные данные Пользователя не передаются каким-либо третьим лицам, за исключением случаев, прямо предусмотренных настоящей Политикой конфиденциальности.<br>
 <br>
 5.2. Предоставление персональных данных Пользователя по запросу государственных органов, органов местного самоуправления осуществляется в порядке, предусмотренном законодательством Российской Федерации.<br>
 <br>
<p>
 <b>6. СРОКИ ХРАНЕНИЯ И УНИЧТОЖЕНИЕ ПЕРСОНАЛЬНЫХ ДАННЫХ</b>
</p>
 6.1. Персональные данные Пользователя хранятся на электронном носителе сайта бессрочно.<br>
 6.2. Персональные данные Пользователя уничтожаются при желании самого пользователя на основании его обращения, либо по инициативе Администратора сайта без объяснения причин путём удаления Администрацией Сайта информации, размещённой Пользователем.<br>
 <br>
<p>
 <b>7. ПРАВА И ОБЯЗАННОСТИ ПОЛЬЗОВАТЕЛЕЙ</b>
</p>
 Пользователи вправе на основании запроса получать от Администрации Сайта информацию, касающуюся обработки его персональных данных.<br>
 <br>
<p>
 <b>8. МЕРЫ ПО ЗАЩИТЕ ИНФОРМАЦИИ О ПОЛЬЗОВАТЕЛЯХ</b>
</p>
 Администратор Сайта принимает технические и организационно-правовые меры в целях обеспечения защиты персональных данных Пользователя от неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий.<br>
 <br>
<p>
 <b>9. ОБРАЩЕНИЯ ПОЛЬЗОВАТЕЛЕЙ</b>
</p>
 9.1. Пользователь вправе направлять Администрации Сайта свои запросы, в т.ч. относительно использования/удаления его персональных данных, предусмотренные п.3 настоящей Политики конфиденциальности в письменной форме по адресу, указанному в п.1.<br>
 9.2. Запрос, направляемый Пользователем, должен содержать следующую информацию:<br>
 для физического лица:<br>
 – номер основного документа, удостоверяющего личность Пользователя или его представителя;<br>
 – сведения о дате выдачи указанного документа и выдавшем его органе;<br>
 – дату регистрации через Форму обратной связи;<br>
 – текст запроса в свободной форме;<br>
 – подпись Пользователя или его представителя.<br>
 для юридического лица:<br>
 – запрос в свободной форме на фирменном бланке;<br>
 – дата регистрации через Форму обратной связи;<br>
 – запрос должен быть подписан уполномоченным лицом с приложением документов, подтверждающих полномочия лица.<br>
 9.3. Администрация Сайта обязуется рассмотреть и направить ответ на поступивший запрос Пользователя в течение 30 дней с момента поступления обращения.<br>
 9.4. Вся корреспонденция, полученная Администрацией от Пользователя (обращения в письменной/электронной форме) относится к информации ограниченного доступа и без письменного согласия Пользователя разглашению не подлежит. Персональные данные и иная информация о Пользователе, направившем запрос, не могут быть без специального согласия Пользователя использованы иначе, как для ответа по теме полученного запроса или в случаях, прямо предусмотренных законодательством.<br>
 <br>
 <br>
 <br>
 <br>
<p style="text-align: center;">
</p>
</div>
        </div>
        <!-- /.container-->
    </div>
<?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>