<template>
    <div class="content">
        <div class="lk">
            <div class="container">
                <div class="section-margin">
                    <h2 class="h1 title">Частые вопросы и ответы</h2>
                    <div class="lk-faq">
                        <!--При клике по заголовку, на блок с классом ".lk-faq-item" добаляется класс "active". Текст раскрывается и закрывается плавно.-->
                        <div class="lk-faq-item" :class="{active:item.active}" v-for="(item, key) in list">
                            <div class="lk-faq-item__title" @click="active(item, key)">{{item.title}}</div>
                            <transition>
                                <div class="lk-faq-item__text" v-html="item.description"></div>
                            </transition>
                        </div>
                    </div>
                </div>
                <div class="section-margin">
                    <h2 class="h1 title">Контакты</h2>
                    <div class="lk-contacts">
                        <div class="lk-contacts__title">
                            <img :src="`${this.$store.state.locationImg}/lk-deal-icon.svg`" alt="">Общие вопросы по покупке и бронированию
                        </div>
                        <div class="lk-contacts__text">
                            Т.к. ранее вы указали, что состоите в законном браке, вам нужно посетить любого сертифицированного нотариуса, с вашей супругой (ом), для получения 
                        </div>
                        <a class="lk-contacts-row" :href="`tel:${$store.state.lk.fksPhone}`">
                            <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M15.6359 11.1586C14.5951 11.1586 13.5732 10.9958 12.6047 10.6757C12.1302 10.5139 11.5469 10.6624 11.2572 10.9598L9.34575 12.4028C7.12898 11.2195 5.76349 9.85442 4.59633 7.65429L5.99684 5.79262C6.3607 5.42924 6.49121 4.89844 6.33485 4.40039C6.01344 3.42687 5.85017 2.40541 5.85017 1.36416C5.85021 0.611956 5.23826 0 4.4861 0H1.36412C0.611956 0 0 0.611956 0 1.36412C0 9.98586 7.01418 17 15.6359 17C16.3881 17 17 16.388 17 15.6359V12.5226C17 11.7705 16.388 11.1586 15.6359 11.1586Z" fill="#E94200"/></svg>
                            {{$store.state.lk.fksPhone}}
                        </a>
                        <a class="lk-contacts-row" :href="`mailto:${$store.state.lk.fskEmail}`">
                            <svg width="22" height="16" viewBox="0 0 22 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M1.93359 0.265625H20.0664C21.1347 0.265625 22 1.13626 22 2.19922V13.8008C22 14.8701 21.1284 15.7344 20.0664 15.7344H1.93359C0.874199 15.7344 0 14.8737 0 13.8008V2.19922C0 1.13815 0.861824 0.265625 1.93359 0.265625ZM2.20438 1.55469C2.59944 1.94764 9.398 8.7104 9.63273 8.9439C9.99797 9.30913 10.4835 9.51022 11 9.51022C11.5165 9.51022 12.002 9.30909 12.3685 8.94269C12.5263 8.78564 19.2499 2.09755 19.7956 1.55469H2.20438ZM20.7109 13.5384V2.4624L15.1406 8.00344L20.7109 13.5384ZM19.7948 14.4453L14.2266 8.91253L13.2788 9.85539C12.6701 10.4641 11.8608 10.7993 11 10.7993C10.1392 10.7993 9.32993 10.4641 8.72244 9.85659L7.77339 8.91253L2.2052 14.4453H19.7948ZM1.28906 13.5384L6.85945 8.00344L1.28906 2.4624V13.5384Z" fill="#E94200"/></svg>
                            {{$store.state.lk.fskEmail}}
                        </a>
                        <div class="lk-contacts-row">
                            <svg width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M11 21C5.48578 21 1 16.5142 1 11C1 5.48578 5.48578 1 11 1C16.5142 1 21 5.48578 21 11C21 16.5142 16.5142 21 11 21ZM11 2.25C6.17502 2.25 2.25 6.17502 2.25 11C2.25 15.825 6.17502 19.75 11 19.75C15.825 19.75 19.75 15.825 19.75 11C19.75 6.17502 15.825 2.25 11 2.25Z" fill="#E94200" stroke="#E94200" stroke-width="0.2"/><path d="M15 16C14.8399 16 14.68 15.9391 14.5583 15.8166L10.5583 11.8571C10.4408 11.7396 10.375 11.5804 10.375 11.4155V5.58203C10.375 5.23703 10.655 4.95703 11 4.95703C11.345 4.95703 11.625 5.23703 11.625 5.58203V11.1562L15.4417 14.9325C15.6859 15.1766 15.6859 15.5724 15.4417 15.8166C15.32 15.9391 15.1601 16 15 16Z" fill="#E94200" stroke="#E94200" stroke-width="0.2"/></svg>
                            {{$store.state.lk.fskTimeWork}}
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>
<script>
    import Vue from 'vue'
    import axios from 'axios';
    import qs from 'qs';
    import Inputmask from 'inputmask';

    export default {
        data () {
            return {
                page: 'lk-block',
                list: {
                    0: {
                        active: false,
                        title: 'Посещение объекта строительства',
                        description: `
                            <p>В процессе строительства дома мы не можем пригласить Вас на территорию стройки, так как это противоречит правилам безопасности. Посещение действующей строительной площадки несет риск для жизни и здоровья. Осмотреть квартиру можно только после того, как будет получено Разрешение на ввод объекта в эксплуатацию и начнется заселение объекта. </p>
                        `,
                    },
                    1: {
                        active: false,
                        title: 'Посещение объекта строительства',
                        description: `
                            <p>В процессе строительства дома мы не можем пригласить Вас на территорию стройки, так как это противоречит правилам безопасности. Посещение действующей строительной площадки несет риск для жизни и здоровья. Осмотреть квартиру можно только после того, как будет получено Разрешение на ввод объекта в эксплуатацию и начнется заселение объекта. </p>
                                <p>В процессе строительства дома мы не можем пригласить Вас на территорию стройки, так как это противоречит правилам безопасности. Посещение действующей строительной площадки несет риск для жизни и здоровья. Осмотреть квартиру можно только после того, как будет получено Разрешение на ввод объекта в эксплуатацию и начнется заселение объекта. </p>
                        `,
                    },
                    2: {
                        active: false,
                        title: 'Посещение объекта строительства',
                        description: `
                            <p>В процессе строительства дома мы не можем пригласить Вас на территорию стройки, так как это противоречит правилам безопасности. Посещение действующей строительной площадки несет риск для жизни и здоровья. Осмотреть квартиру можно только после того, как будет получено Разрешение на ввод объекта в эксплуатацию и начнется заселение объекта. </p>
                        `,
                    },
                },
            }
        },
        created() {},
        updated() {},
        components: {},
        computed: {},
        methods: {
            active(item, key) {
                for (let i in this.list) {
                    if(key !== i) this.$set(this.list[i], 'active', false);
                }
                this.$set(item, 'active', !item.active);
            }
        },
    };
</script>