
<title>link</title>
<div class="content">
	<p>
		 Группа компаний ФСК (ранее ФСК «Лидер») является одной из крупнейших строительных компаний России, входит в десятку крупнейших девелоперов страны и пятерку социально ответственных строительных компаний.
	</p>
	<h2 class="h1 title">ГК ФСК сегодня</h2>
	<div class="contacts-today">
		<div class="contacts-today-content">
			<p>
				 ГК ФСК работает не только в Санкт-Петербурге и Ленинградской области, но также в Москве и Московской области, Калужской области и Краснодарском крае. В структуру холдинга входят собственные производственные мощности, генподрядные организации, технический заказчик, агентство недвижимости, сервисные службы.Компания, основанная в 2005 году, зарекомендовала себя надежным партнером, который всегда выполняет обязательства.&nbsp;
			</p>
			<p>
				Вертикально интегрированная структура ФСК позволяет в короткие сроки своими силами проектировать и строить объекты любого уровня сложности, используя преимущественно собственное финансирование. Именно поэтому бизнес компании очень устойчив, а кредитная нагрузка минимальна. В 2016 году в структуру холдинга вошел ДСК-1 – крупнейшее предприятие по производству панельных домов с полувековой историей.<br>
			</p>
 <button class="btn btn--transp contacts-today-content__btn" type="button">
			Читать дальше </button>
		</div>
		<div class="contacts-today__img">
 <img src="/local/templates/fsk/img/contacts-map.svg" alt="">
		</div>
	</div>
	<div class="contacts-akpa">
 <img src="/local/templates/fsk/img/contacts-akpa.svg" alt="">
		<div class="contacts-akpa__text">
			 Рейтинговое агентство АКРА впервые присвоило ГК ФСК кредитный рейтинг BBB+(RU) со стабильным прогнозом, подтвердив высокую степень надежности компании.
		</div>
	</div>
</div>
 <br>