<template>
    <div>
        <h2 class="h1 title">Как будет проходить ваша сделка по шагам?</h2>
        <div class="instruction__banner"><img :src="`${$store.state.locationImg}/instruction-banner.jpg`" alt="alt"></div>
        <div class="instruction-items section-margin">
            <div class="instruction-items-item">
            <div class="instruction-items-item__title"><span> </span>Кредитная анкета</div>
                <div class="instruction-items-item__text">
                    Вам потребуется заполнить универсальную
                    анкету на одобрение ипотеки, а также
                    подписать информированные согласия на
                    обработку ваших персональных данных
                    банками-партнерами.
                </div>
            </div>
            <div class="instruction-items-item">
                <div class="instruction-items-item__title"><span> </span>Анкета покупателя</div>
                <div class="instruction-items-item__text">После внесения данных сформируется договор - вы сможете с ним ознакомиться и проверить содержание.</div>
            </div>
            <div class="instruction-items-item">
            <div class="instruction-items-item__title"><span> </span>Формирование договора</div>
                <div class="instruction-items-item__text">
                    Если все данные заполнены верно. то теперь
                    вы можете ознакомиться с готовым договором
                    и проверить всю информацию в нем.
                </div>
            </div>
            <div class="instruction-items-item">
            <div class="instruction-items-item__title"><span> </span>Визит в банк</div>
                <div class="instruction-items-item__text">
                    Где Вы получите усиленную электронную
                    подпись, подпишите документы для договора и
                    кредитного договора, откроете аккредитив и
                    осуществите оплату.
                </div>
            </div>
            <div class="instruction-items-item">
            <div class="instruction-items-item__title"><span> </span>Визит к нотариусу</div>
                <div class="instruction-items-item__text">
                    Этот этап необходим, только если вы состоите в официальном браке.<br>
                    Нотариус заверит тождественность согласия супруга/и свидетельства о браке/брачного договора.
                </div>
            </div>
            <div class="instruction-items-item">
                <div class="instruction-items-item__title"><span></span>Отправка на регистрацию</div>
                <div class="instruction-items-item__text">Наш менеджер проверяет все документы и загружает для отправки на регистрацию. Ожидайте смс-сообщение с кодом, который нужно будет сообщить нашему специалисту.</div>
            </div>
            <div class="instruction-items-item">
                <div class="instruction-items-item__title"><span> </span>Регистрация произведена</div>
                <div class="instruction-items-item__text">Поздравляем, сделка успешно зарегистирована в РосРеестре.</div>
            </div>
        </div>
        <h2 class="h1 title">Вам потребуется</h2>
        <div class="instruction-items section-margin">
            <div class="instruction-items-item">
            <div class="instruction-items-item__title">
                <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <circle cx="25" cy="25" r="25" fill="#F6F8FA"></circle>
                    <rect x="34.6667" y="12.1078" width="25.3" height="18.3323" rx="1.15" transform="rotate(90 34.6667 12.1078)" stroke="#E94200" stroke-width="1.7"></rect>
                    <path d="M25.6566 20.7491C26.309 20.7491 26.8739 20.5151 27.3356 20.0534C27.7971 19.5918 28.0312 19.027 28.0312 18.3745C28.0312 17.7222 27.7972 17.1573 27.3355 16.6955C26.8738 16.234 26.309 16 25.6566 16C25.0041 16 24.4393 16.234 23.9777 16.6956C23.5161 17.1572 23.282 17.7221 23.282 18.3745C23.282 19.027 23.5161 19.5919 23.9777 20.0535C24.4394 20.515 25.0043 20.7491 25.6566 20.7491V20.7491ZM24.3863 17.1041C24.7405 16.7499 25.156 16.5777 25.6566 16.5777C26.1572 16.5777 26.5728 16.7499 26.927 17.1041C27.2812 17.4584 27.4535 17.874 27.4535 18.3745C27.4535 18.8751 27.2812 19.2906 26.927 19.6449C26.5728 19.9992 26.1572 20.1713 25.6566 20.1713C25.1561 20.1713 24.7406 19.9991 24.3863 19.6449C24.032 19.2907 23.8597 18.8751 23.8597 18.3745C23.8597 17.874 24.032 17.4584 24.3863 17.1041Z" fill="#E94200" stroke="#E94200" stroke-width="0.9"></path>
                    <path d="M30.087 24.7956C30.0729 24.6098 30.0442 24.4072 30.0019 24.1931C29.9593 23.9775 29.9044 23.7736 29.8387 23.5873C29.7707 23.3948 29.6785 23.2046 29.5643 23.0224C29.4459 22.8332 29.3068 22.6685 29.1507 22.533C28.9875 22.3912 28.7876 22.2772 28.5565 22.194C28.3261 22.1113 28.0709 22.0694 27.7979 22.0694C27.6906 22.0694 27.587 22.1093 27.3867 22.2277C27.2634 22.3007 27.1193 22.3851 26.9583 22.4784C26.8207 22.558 26.6343 22.6326 26.4041 22.7001C26.1795 22.7661 25.9514 22.7995 25.7262 22.7995C25.5012 22.7995 25.2731 22.7661 25.0483 22.7001C24.8183 22.6326 24.6318 22.5581 24.4945 22.4785C24.3351 22.386 24.1908 22.3016 24.0657 22.2276C23.8656 22.1093 23.7619 22.0693 23.6547 22.0693C23.3816 22.0693 23.1264 22.1113 22.8962 22.1941C22.6652 22.2771 22.4653 22.3911 22.3019 22.533C22.1458 22.6686 22.0067 22.8333 21.8884 23.0224C21.7743 23.2046 21.682 23.3947 21.6141 23.5874C21.5484 23.7737 21.4935 23.9775 21.4509 24.1931C21.4086 24.4069 21.38 24.6096 21.3658 24.7959C21.3518 24.9779 21.3448 25.1675 21.3448 25.3589C21.3448 25.8567 21.5191 26.2597 21.8628 26.5568C22.2023 26.8501 22.6514 26.9988 23.1977 26.9988H28.2554C28.8015 26.9988 29.2506 26.8501 29.5902 26.5568C29.934 26.2599 30.1083 25.8568 30.1083 25.3589C30.1082 25.1667 30.1011 24.9772 30.087 24.7956V24.7956ZM29.1658 26.152C28.9415 26.3458 28.6437 26.44 28.2553 26.44H23.1977C22.8092 26.44 22.5114 26.3458 22.2872 26.1521C22.0672 25.962 21.9603 25.7025 21.9603 25.3589C21.9603 25.1803 21.9668 25.0038 21.9798 24.8345C21.9925 24.6683 22.0184 24.4858 22.0567 24.2918C22.0946 24.1003 22.1429 23.9205 22.2003 23.7578C22.2553 23.6017 22.3304 23.4472 22.4235 23.2984C22.5124 23.1565 22.6147 23.0348 22.7275 22.9367C22.833 22.845 22.9661 22.7699 23.1228 22.7136C23.2678 22.6615 23.4307 22.633 23.6076 22.6287C23.6291 22.6391 23.6675 22.659 23.7297 22.6958C23.8563 22.7706 24.0021 22.8561 24.1633 22.9495C24.3451 23.0547 24.5793 23.1497 24.859 23.2317C25.145 23.3157 25.4367 23.3583 25.7263 23.3583C26.0158 23.3583 26.3076 23.3157 26.5935 23.2318C26.8735 23.1497 27.1076 23.0547 27.2896 22.9494C27.4546 22.8537 27.5963 22.7707 27.7229 22.6958C27.7851 22.659 27.8234 22.6391 27.845 22.6287C28.0219 22.633 28.1849 22.6615 28.3299 22.7136C28.4866 22.7699 28.6196 22.8451 28.7252 22.9367C28.838 23.0347 28.9403 23.1564 29.0291 23.2984C29.1223 23.4472 29.1975 23.6018 29.2525 23.7577C29.3099 23.9207 29.3583 24.1004 29.3961 24.2918C29.4344 24.4861 29.4604 24.6687 29.473 24.8346V24.8347C29.4861 25.0034 29.4926 25.1798 29.4927 25.3589C29.4926 25.7025 29.3857 25.962 29.1658 26.152V26.152Z" fill="#E94200" stroke="#E94200" stroke-width="0.9"></path>
                    <line x1="20.851" y1="32.15" x2="30.151" y2="32.15" stroke="#E94200" stroke-width="1.7" stroke-linecap="round"></line>
                </svg>
                Паспорт
            </div>
            <div class="instruction-items-item__text">Паспорт гражданина РФ или другое удостоверение личности в отдельных случаях (не-резидент и т.д.)</div>
            </div>
            <div class="instruction-items-item">
            <div class="instruction-items-item__title">
                <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <circle cx="25" cy="25" r="25" fill="#F6F8FA"></circle>
                    <rect x="12.85" y="15.5922" width="25.3" height="18.3323" rx="1.15" stroke="#E94200" stroke-width="1.7"></rect>
                    <path d="M32.0318 15.6114L32.0318 24.3211" stroke="#E94200" stroke-width="1.7"></path>
                    <path d="M37.4989 19.9683L12.9989 19.9684" stroke="#E94200" stroke-width="1.7" stroke-linecap="round" stroke-linejoin="round"></path>
                    <path d="M23.3215 24.3217L16.3538 24.3217" stroke="#E94200" stroke-width="1.7" stroke-linecap="round" stroke-linejoin="round"></path>
                    <path d="M23.3215 28.6786L16.3538 28.6786" stroke="#E94200" stroke-width="1.7" stroke-linecap="round" stroke-linejoin="round"></path>
                    <path d="M32.0304 29.5478L32.0318 34.7736" stroke="#E94200" stroke-width="1.7"></path>
                    <circle cx="32.0315" cy="26.9363" r="2.63387" stroke="#E94200" stroke-width="1.7"></circle>
                </svg>
                СНИЛС
            </div>
            <div class="instruction-items-item__text">Страховой номер индивидуального лицевого счёта - “зеленая карточка”. </div>
            </div>
            <div class="instruction-items-item">
            <div class="instruction-items-item__title">
                <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <circle cx="25" cy="25" r="24.5" fill="#F6F8FA" stroke="white"></circle>
                    <rect x="34.6667" y="12.1078" width="25.3" height="18.3323" rx="1.15" transform="rotate(90 34.6667 12.1078)" stroke="#E94200" stroke-width="1.7"></rect>
                    <path d="M20.001 20L31.001 20" stroke="#E94200" stroke-width="1.7" stroke-linecap="round" stroke-linejoin="round"></path>
                    <path d="M20.001 24L31.001 24" stroke="#E94200" stroke-width="1.7" stroke-linecap="round" stroke-linejoin="round"></path>
                    <path d="M20.001 28L23.001 28" stroke="#E94200" stroke-width="1.7" stroke-linecap="round" stroke-linejoin="round"></path>
                    <path d="M20.001 32L23.001 32" stroke="#E94200" stroke-width="1.7" stroke-linecap="round" stroke-linejoin="round"></path>
                    <path d="M23.001 16L28.001 16" stroke="#E94200" stroke-width="1.7" stroke-linecap="round" stroke-linejoin="round"></path>
                    <path d="M29.001 32.15C27.8136 32.15 26.851 31.1874 26.851 30C26.851 28.8126 27.8136 27.85 29.001 27.85C30.1884 27.85 31.151 28.8126 31.151 30C31.151 31.1874 30.1884 32.15 29.001 32.15Z" stroke="#E94200" stroke-width="1.7"></path>
                </svg>
                ИНН
            </div>
            <div class="instruction-items-item__text">Ваше свидетельство и номер налогоплательщика. </div>
            </div>
            <div class="instruction-items-item">
            <div class="instruction-items-item__title">
                <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <circle cx="25" cy="25" r="25" fill="#F6F8FA"></circle>
                    <path d="M24.8288 22.4088C26.3961 22.4088 27.7532 21.8466 28.8623 20.7375C29.971 19.6286 30.5334 18.2717 30.5334 16.7042C30.5334 15.1372 29.9712 13.7802 28.8621 12.6709C27.753 11.5621 26.396 11 24.8288 11C23.2612 11 21.9044 11.5621 20.7955 12.6711C19.6865 13.78 19.1242 15.137 19.1242 16.7042C19.1242 18.2717 19.6865 19.6288 20.7955 20.7377C21.9048 21.8464 23.2618 22.4088 24.8288 22.4088V22.4088ZM21.777 13.6524C22.6279 12.8015 23.6261 12.3879 24.8288 12.3879C26.0313 12.3879 27.0297 12.8015 27.8807 13.6524C28.7316 14.5035 29.1454 15.5019 29.1454 16.7042C29.1454 17.9069 28.7316 18.9051 27.8807 19.7562C27.0297 20.6072 26.0313 21.0208 24.8288 21.0208C23.6264 21.0208 22.6283 20.6071 21.777 19.7562C20.9259 18.9053 20.5121 17.9069 20.5121 16.7042C20.5121 15.5019 20.9259 14.5035 21.777 13.6524Z" fill="#E84001" stroke="#E84001" stroke-width="0.4"></path>
                    <path d="M35.4743 30.7073C35.4402 30.261 35.3713 29.7741 35.2698 29.2599C35.1674 28.7419 35.0355 28.2522 34.8777 27.8046C34.7144 27.342 34.4928 26.8852 34.2185 26.4474C33.9341 25.993 33.5999 25.5973 33.2249 25.2717C32.8327 24.9311 32.3526 24.6572 31.7974 24.4575C31.2441 24.2587 30.6309 24.1581 29.975 24.1581C29.7174 24.1581 29.4683 24.254 28.9872 24.5384C28.6911 24.7137 28.3447 24.9164 27.9582 25.1406C27.6276 25.3318 27.1798 25.511 26.6267 25.6731C26.0871 25.8317 25.5392 25.912 24.9982 25.912C24.4576 25.912 23.9097 25.8317 23.3697 25.6731C22.8172 25.5111 22.3692 25.332 22.0392 25.1408C21.6563 24.9187 21.3097 24.7159 21.0092 24.5382C20.5285 24.2538 20.2794 24.1579 20.0218 24.1579C19.3657 24.1579 18.7527 24.2587 18.1996 24.4576C17.6448 24.657 17.1644 24.9309 16.7719 25.2719C16.3969 25.5976 16.0627 25.9931 15.7785 26.4474C15.5046 26.8852 15.2828 27.3418 15.1195 27.8048C14.9618 28.2524 14.83 28.7419 14.7276 29.2599C14.6259 29.7734 14.5572 30.2604 14.5231 30.7079C14.4896 31.1453 14.4727 31.6006 14.4727 32.0606C14.4727 33.2563 14.8914 34.2244 15.7171 34.9383C16.5326 35.6428 17.6115 36 18.9239 36H31.0741C32.3861 36 33.465 35.6428 34.2807 34.9383C35.1066 34.2249 35.5253 33.2565 35.5253 32.0604C35.5251 31.5988 35.508 31.1435 35.4743 30.7073V30.7073ZM33.2611 33.9657C32.7222 34.4313 32.0068 34.6576 31.0739 34.6576H18.9239C17.9907 34.6576 17.2753 34.4313 16.7367 33.9659C16.2082 33.5092 15.9514 32.8858 15.9514 32.0606C15.9514 31.6313 15.967 31.2075 15.9982 30.8007C16.0286 30.4015 16.0908 29.963 16.183 29.4971C16.274 29.0369 16.3899 28.605 16.5278 28.2141C16.66 27.8392 16.8404 27.468 17.0641 27.1104C17.2776 26.7696 17.5233 26.4772 17.7944 26.2417C18.0479 26.0213 18.3675 25.8409 18.7441 25.7056C19.0923 25.5805 19.4837 25.512 19.9086 25.5017C19.9604 25.5267 20.0526 25.5744 20.202 25.6628C20.506 25.8427 20.8564 26.0478 21.2437 26.2724C21.6803 26.5251 22.2429 26.7534 22.915 26.9503C23.6021 27.152 24.3028 27.2544 24.9984 27.2544C25.694 27.2544 26.3949 27.152 27.0816 26.9505C27.7543 26.7532 28.3166 26.5251 28.7538 26.2721C29.1502 26.0421 29.4908 25.8428 29.7948 25.6628C29.9442 25.5746 30.0364 25.5267 30.0882 25.5017C30.5133 25.512 30.9047 25.5805 31.2531 25.7056C31.6295 25.8409 31.9491 26.0214 32.2026 26.2417C32.4737 26.4771 32.7193 26.7695 32.9328 27.1106C33.1567 27.468 33.3373 27.8394 33.4694 28.2139C33.6074 28.6054 33.7235 29.0371 33.8144 29.4969C33.9064 29.9637 33.9688 30.4024 33.9992 30.8008V30.8012C34.0306 31.2065 34.0464 31.6301 34.0466 32.0606C34.0464 32.886 33.7895 33.5092 33.2611 33.9657V33.9657Z" fill="#E84001" stroke="#E84001" stroke-width="0.4"></path>
                </svg>
                Нотариус
            </div>
            <div class="instruction-items-item__text">Он потребуется для оформления тождественности о браке и некоторых других документов - таков закон. </div>
            </div>
            <div class="instruction-items-item">
            <div class="instruction-items-item__title">
                <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <circle cx="25" cy="25" r="25" fill="#F6F8FA"></circle>
                    <rect x="11.85" y="15.85" width="25.3" height="18.3323" rx="1.15" stroke="#E94200" stroke-width="1.7"></rect>
                    <path d="M33 25L16 25" stroke="#E94200" stroke-width="1.7" stroke-linecap="round" stroke-linejoin="round"></path>
                    <path d="M25 30L16 30" stroke="#E94200" stroke-width="1.7" stroke-linecap="round" stroke-linejoin="round"></path>
                    <path d="M33 30L30 30M19 20.5L16 20.5" stroke="#E94200" stroke-width="1.7" stroke-linecap="round" stroke-linejoin="round"></path>
                </svg>
                Средства на счету
            </div>
            <div class="instruction-items-item__text">100% оплата или первый взнос по ипотеке, которые будут перечисляться после подписания договора. </div>
            </div>
            <div class="instruction-items-item">
            <div class="instruction-items-item__title">
                <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <circle cx="25" cy="25" r="25" fill="#F6F8FA"></circle>
                    <path d="M30.2764 23.3125C30.2764 22.7947 29.8567 22.375 29.3389 22.375H19.6826C19.1648 22.375 18.7451 22.7947 18.7451 23.3125C18.7451 23.8303 19.1648 24.25 19.6826 24.25H29.3389C29.8567 24.25 30.2764 23.8303 30.2764 23.3125Z" fill="#E94200"></path>
                    <path d="M19.6826 26.125C19.1648 26.125 18.7451 26.5447 18.7451 27.0625C18.7451 27.5803 19.1648 28 19.6826 28H25.5472C26.065 28 26.4847 27.5803 26.4847 27.0625C26.4847 26.5447 26.065 26.125 25.5472 26.125H19.6826Z" fill="#E94200"></path>
                    <path d="M21.8854 35.125H18.75C17.7161 35.125 16.875 34.2839 16.875 33.25V16.75C16.875 15.7161 17.7161 14.875 18.75 14.875H30.276C31.3099 14.875 32.151 15.7161 32.151 16.75V22.5156C32.151 23.0334 32.5708 23.4531 33.0885 23.4531C33.6063 23.4531 34.026 23.0334 34.026 22.5156V16.75C34.026 14.6823 32.3438 13 30.276 13H18.75C16.6822 13 15 14.6823 15 16.75V33.25C15 35.3177 16.6822 37 18.75 37H21.8854C22.4032 37 22.8229 36.5803 22.8229 36.0625C22.8229 35.5447 22.4032 35.125 21.8854 35.125Z" fill="#E94200"></path>
                    <path d="M35.688 26.5721C34.5914 25.4755 32.8071 25.4754 31.7112 26.5713L26.5642 31.7069C26.4549 31.816 26.3743 31.9504 26.3294 32.0981L25.2085 35.7884C25.1091 36.1155 25.1957 36.4708 25.4345 36.7155C25.6133 36.8989 25.8563 36.9984 26.1056 36.9984C26.189 36.9984 26.2731 36.9872 26.3558 36.9643L30.1398 35.9161C30.2955 35.873 30.4374 35.7904 30.5518 35.6762L35.688 30.5496C36.7846 29.453 36.7846 27.6688 35.688 26.5721ZM29.4017 34.175L27.498 34.7023L28.0551 32.8682L31.528 29.4029L32.8541 30.729L29.4017 34.175ZM34.3629 29.2232L34.1812 29.4045L32.8554 28.0786L33.0364 27.898C33.4019 27.5324 33.9967 27.5324 34.3622 27.898C34.7278 28.2635 34.7277 28.8583 34.3629 29.2232Z" fill="#E94200"></path>
                    <path d="M29.3389 18.625H19.6826C19.1648 18.625 18.7451 19.0447 18.7451 19.5625C18.7451 20.0803 19.1648 20.5 19.6826 20.5H29.3389C29.8567 20.5 30.2764 20.0803 30.2764 19.5625C30.2764 19.0447 29.8567 18.625 29.3389 18.625Z" fill="#E94200"></path>
                </svg>
                Бумага и ручка
            </div>
            <div class="instruction-items-item__text">Весь процесс проходит онлайн, но некоторые документы потребуется подписать, отсканировать (или сфотографировать) и отправить нам. </div>
            </div>
        </div>
    </div>
</template>