<?
use \Bitrix\Main\Loader;
use \Bitrix\Main\Application;
use \Bitrix\Main\Localization\Loc;
use \Bitrix\Main\SystemException;
use \Bitrix\Sale\Order;
use \Bitrix\Sale\PaySystem;
use RaStudio\Table\OrderTable;

require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");

define("STOP_STATISTICS", true);
define('NO_AGENT_CHECK', true);
define('NOT_CHECK_PERMISSIONS', true);
define("DisableEventsCheck", true);

global $USER;
/*
if($USER->IsAdmin()){

    if (CModule::IncludeModule("sale"))
    {
        $context = Application::getInstance()->getContext();
        $request = $context->getRequest();
?><pre><?print_r($request->getHeaders()->get('connection'))?></pre><?
?><pre><?print_r($request)?></pre><?
        $item = PaySystem\Manager::searchByRequest($request);

        if ($item !== false)
        {
            $service = new PaySystem\Service($item);
            if ($service instanceof PaySystem\Service)
            {
                $result = $service->processRequest($request);

            }
        }
        else
        {
            $debugInfo = implode("\n", $request->toArray());
            PaySystem\Logger::addDebugInfo('Pay system not found. Request: '.$debugInfo);
        }
    }

    //$APPLICATION->FinalActions();

    ?>

<?}else{?>
<?}
*/

global $USER;
$name = '';
$lastName = '';
$email = '';
$phone = '';

if (isset($_POST['id']) && isset($_POST['iblock'])) {
    $_SESSION['RESERVE'] = ['ID' => $_POST['id'], 'IBLOCK' => $_POST['iblock']];
}
$successful = false;
if ( isset($_GET['PAYMENT'] ) && $_GET['PAYMENT']=='SBERBANK' && CModule::IncludeModule('iblock')){
    $successful = true;
    //if ($_SESSION['RESERVE_SEND_TIME']<=(time()-(20*60))){

    /*$_SESSION['RESERVE'] = array();
    OrderTable::update($_GET['ORDER_ID'], array('ID'=>$_GET['ORDER_ID'],'UF_STATUS'=>2));
    $order = OrderTable::getOrderById($_GET['ORDER_ID']);
    $PRODUCT_ID = $order['UF_PRODUCT'];*/
    /*if (CModule::IncludeModule("iblock")) {
        CIBlockElement::SetPropertyValuesEx(
           // $PRODUCT_ID, false, array("UF_STATUS" => '31')
        );
    }*/
    /*if ($_SESSION['RESERVE_SENT'] != 'Y') {
        OrderTable::sendSuccess($_GET['ORDER_ID']);
        $_SESSION['RESERVE_SENT'] = 'Y';
    }*/
    // }
}

if ($USER->IsAuthorized()){
    $rsUser = CUser::GetByID($_SESSION['SESS_AUTH']['USER_ID'])->Fetch();
    $name = $rsUser['NAME'];
    $lastName = $rsUser['LAST_NAME'];
    $email = $rsUser['EMAIL'];
    $phone = $rsUser['PERSONAL_PHONE'];
}

//скидка в %
$discount = 1;

if (isset($_SESSION['RESERVE']['IBLOCK']) && isset($_SESSION['RESERVE']['ID']) && CModule::IncludeModule('iblock')) {
    $id = $_SESSION['RESERVE']['ID'];
    $iblock  = $_SESSION['RESERVE']['IBLOCK'];
    $object = array();
    $lk = '';
    $arFilter = Array("IBLOCK_ID"=>$iblock, "ID"=>$id);
    $res = CIBlockElement::GetList(Array(), $arFilter, false, Array());
    while($ob = $res->GetNextElement()){
        $object = $ob->GetFields();
        $object['PROPERTIES'] = $ob->GetProperties();
        if ($object['PROPERTIES']['category']['VALUE'] == 'flat'){
            $price = $object['PROPERTIES']['priceOnline100']['VALUE'];
        }else{
            $price = $object['PROPERTIES']['price100']['VALUE'];
        }
        //$object['PROPERTIES']['price100']['VALUE'] = round($object['PROPERTIES']['price100']['VALUE']*(1-$discount/100));
    }
    $image = CFile::GetPath($object['PROPERTIES']['image']['VALUE'][0]);

    $res = CIBlockSection::GetByID($object['IBLOCK_SECTION_ID']);
    if($ar_res = $res->GetNext()){
        $result = CIBlockSection::GetByID($ar_res['IBLOCK_SECTION_ID']);
        if($ar_result = $result->GetNext()){
            $lk = $ar_result['CODE'];
        }
    }
}

$objectType = [
    'storeroom' => [1 => 'кладовой', 2 => 'кладовая'],
    'flat' => [1 => 'квартиры', 2 => 'квартира'],
    'parking' => [1 => 'машино-места', 2 => 'машино-место', 3 => 'паркинга', 4 => 'паркинг'],
    'commercial' => [1 => 'коммерческого помещения', 2 => 'коммерческое помещение'],
];

if ($object['PROPERTIES']['category']['VALUE'] === 'parking') {
    $objectTypeVal = $objectType[$object['PROPERTIES']['category']['VALUE']][3];
} else {
    $objectTypeVal = $objectType[$object['PROPERTIES']['category']['VALUE']][1];
}
$APPLICATION->SetPageProperty("description", "Бронирование".$objectTypeVal);
$APPLICATION->SetPageProperty("TITLE", "Бронирование ".$objectTypeVal);
$APPLICATION->SetTitle("Бронирование ".$objectTypeVal);

$error = false;
$typeError = 0;
if (!isset($object) || empty($object)){
    $error = true;
    $typeError = 1;
} else if($object['PROPERTIES']['UF_STATUS']['VALUE'] == 'Забронирована' && $successful === false) {
    $error = true;
    $typeError = 2;
}

$dopText = "<p style=\"font-size: 0.7em;\">
На все объекты недвижимости применяется скидка 15% от базовой стоимости при 100% оплате/ипотеке (кроме программ с субсидированной ставкой от ПАО «Сбербанк»), цена на сайте указана с учетом скидки.
<br> При применении ипотечных программ с субсидированной ставкой от ПАО «Сбербанк» скидка составляет 10% от базовой стоимости (рассчитывается менеджером).
</p>";

?>

<?global $USER;?>
<?$reseveSum = "30 000"?>
<?$reseveSumText = "тридцать тысяч"?>
<div class="page reservation <?if ($USER->IsAdmin()) {?>reserv-info-padding<?}?>">
    <?if ($successful){?>
        <div class="reservation-top">
            <div data-type="nav" data-id="confirm" class="reservation-top-item completed">
                <div class="reservation-top-item__circle">1</div>
                <div class="reservation-top-item__text">Договор</br>оферта</div>
            </div>
            <svg width="12" height="30" viewBox="0 0 12 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M1 1L11 15L1 29" stroke="#BEBEBE" stroke-width="1.5"/>
            </svg>
            <div data-type="nav" data-id="card" class="reservation-top-item completed">
                <div class="reservation-top-item__circle">2</div>
                <div class="reservation-top-item__text">Данные</br>покупателя</div>
            </div>
            <svg width="12" height="30" viewBox="0 0 12 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M1 1L11 15L1 29" stroke="#BEBEBE" stroke-width="1.5"/>
            </svg>
            <div data-type="nav" data-id="payment" class="reservation-top-item active">
                <div class="reservation-top-item__circle">3</div>
                <div class="reservation-top-item__text">Оплата</br>резерва</div>
            </div>
        </div>
    <?}else{?>
        <div class="reservation-top">
            <div data-type="nav" data-id="confirm" class="reservation-top-item active">
                <div class="reservation-top-item__circle">1</div>
                <div class="reservation-top-item__text">Договор</br>оферта</div>
            </div>
            <svg width="12" height="30" viewBox="0 0 12 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M1 1L11 15L1 29" stroke="#BEBEBE" stroke-width="1.5"/>
            </svg>
            <div data-type="nav" data-id="card" class="reservation-top-item">
                <div class="reservation-top-item__circle">2</div>
                <div class="reservation-top-item__text">Данные</br>покупателя</div>
            </div>
            <svg width="12" height="30" viewBox="0 0 12 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M1 1L11 15L1 29" stroke="#BEBEBE" stroke-width="1.5"/>
            </svg>
            <div data-type="nav" data-id="payment" class="reservation-top-item">
                <div class="reservation-top-item__circle">3</div>
                <div class="reservation-top-item__text">Оплата</br>резерва</div>
            </div>
        </div>
    <?}?>
    <div class="container">
        <div id="confirm" <?=($successful || $error)?'style="display:none;"':'style="display:block;"'?> data-type="content" class="reservation-oferta" >
                <?if (isset($object) && !empty($object)){?>
                    <?if ($object['PROPERTIES']['apartments']['VALUE'] == 'true'){
                        ?>
                        <div class="about-bron">
                            <?=$dopText?>
                            <div class="about-bron-text">
                                <p>
                                    <strong class="about-bron-text__title">Основные условия бронирования:</strong>
                                    1. Стоимость бронирования составляет <?=$reseveSum?> руб. Это сумма в дальнейшем включается в стоимость лота.
                                </p>
                                <p>
                                    2. Бронирование подразумевает фиксацию стоимости на момент оплаты бронирования, а также закрепление данного объекта за вами на срок:<br>
                                    - при 100% оплате 5 дней.<br>
                                    - при ипотеке 14 дней.<br>
                                </p>
                                <p>
                                    3. При оформлении онлайн-бронирования предоставляется скидка в 1% от стоимости, суммируется с прочими скидками и спецпредложениями.
                                </p>
                            </div>
                            <svg class="about-bron__svg" width="108" height="108" viewBox="0 0 108 108" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M86.9062 28.6875C86.9062 29.8518 87.8513 30.7969 89.0156 30.7969C90.1799 30.7969 91.125 29.8518 91.125 28.6875C91.125 27.5232 90.1799 26.5781 89.0156 26.5781C87.8513 26.5781 86.9062 27.5232 86.9062 28.6875Z" fill="#D7D7D7"/>
                                <path d="M95.3431 54.0008C95.3431 56.7027 95.072 59.3995 94.5381 62.0165C94.3049 63.1577 95.0415 64.2717 96.1827 64.5049C96.3253 64.5345 96.467 64.5485 96.6071 64.5485C97.5884 64.5485 98.4676 63.8589 98.672 62.8602C99.2628 59.9656 99.5619 56.9853 99.5619 54.0008C99.5619 47.3588 98.1216 40.9672 95.2797 35.0033C94.7787 33.9519 93.5205 33.5053 92.4683 34.0063C91.416 34.5072 90.9703 35.7663 91.4712 36.8185C94.0404 42.2106 95.3431 47.9916 95.3431 54.0008Z" fill="#D7D7D7"/>
                                <path d="M64.5469 72.9844H62.4375V45.5625C62.4375 44.3974 61.4932 43.4531 60.3281 43.4531H43.4531C42.288 43.4531 41.3438 44.3974 41.3438 45.5625V54C41.3438 55.1651 42.288 56.1094 43.4531 56.1094H45.5625V72.9844H43.4531C42.288 72.9844 41.3438 73.9286 41.3438 75.0938V83.5312C41.3438 84.6964 42.288 85.6406 43.4531 85.6406H64.5469C65.712 85.6406 66.6562 84.6964 66.6562 83.5312V75.0938C66.6562 73.9286 65.712 72.9844 64.5469 72.9844ZM62.4375 81.4219H45.5625V77.2031H47.6719C48.837 77.2031 49.7812 76.2589 49.7812 75.0938V54C49.7812 52.8349 48.837 51.8906 47.6719 51.8906H45.5625V47.6719H58.2188V75.0938C58.2188 76.2589 59.1638 77.2031 60.3281 77.2031H62.4375V81.4219Z" fill="#D7D7D7"/>
                                <path d="M54 39.2344C58.6522 39.2344 62.4375 35.449 62.4375 30.7969C62.4375 26.1447 58.6522 22.3594 54 22.3594C49.3478 22.3594 45.5625 26.1447 45.5625 30.7969C45.5625 35.449 49.3478 39.2344 54 39.2344ZM54 26.5781C56.3261 26.5781 58.2188 28.4708 58.2188 30.7969C58.2188 33.123 56.3261 35.0156 54 35.0156C51.6739 35.0156 49.7812 33.123 49.7812 30.7969C49.7812 28.4708 51.6739 26.5781 54 26.5781Z" fill="#D7D7D7"/>
                                <path d="M54.0001 0C24.8957 0 9.19855e-05 24.8486 9.19855e-05 54C9.19855e-05 63.9577 2.85352 74.5475 7.6647 82.5573L0.108033 105.224C-0.144104 105.981 0.0528264 106.818 0.618073 107.382C1.18579 107.95 2.02295 108.143 2.77689 107.891L25.4436 100.335C33.4526 105.147 44.0424 108 54.0001 108C83.1119 108 108 83.1481 108 54C108 24.8882 83.149 0 54.0001 0V0ZM54.0001 103.781C44.4478 103.781 34.2947 100.962 26.8402 96.2411C26.3121 95.9065 25.6537 95.8184 25.044 96.0219L5.44492 102.555L11.9782 82.9561C12.1793 82.3546 12.0985 81.6954 11.759 81.1599C7.03766 73.7062 4.21884 63.5523 4.21884 54C4.21884 27.0157 27.0157 4.21875 54.0001 4.21875C80.9844 4.21875 103.781 27.0157 103.781 54C103.781 80.9843 80.9844 103.781 54.0001 103.781Z" fill="#D7D7D7"/>
                            </svg>
                        </div>
                        <h2 class="h1 title">Договор оферта</h2>
                        <div>
                            <p>
                                <b>1. Общие положения</b>
                            </p>
                            <p>
                                1.1. Настоящий Договор-оферта (далее – Договор) является официальным предложением (публичной офертой)<b> Общества с ограниченной ответственностью «Агентство недвижимости «ФСК Северо-Запад» (ООО «АН «ФСК Северо-Запад»)</b>, ОГРН: 1187847371095, ИНН/КПП 7813627626/781301001, зарегистрировано Межрайонной инспекцией Федеральной налоговой службы №15 по Санкт-Петербургу 10.12.2018, адрес: 197198, г. Санкт-Петербург, Большой пр. П.С., д. 48, лит. А, пом. 2-Н, офис 106, в лице генерального директора Межевской Анастасии Ивановны, действующей на основании Устава, именуемое в дальнейшем «Исполнитель», <i>для полностью дееспособных физических лиц и юридических лиц</i>, которые примут настоящее предложение на указанных ниже условиях.
                            </p>
                            <p>
                                1.2. В соответствии с пунктом 2 статьи 437 Гражданского кодекса Российской Федерации (далее – ГК РФ) в случае принятия изложенных ниже условий и оплаты услуг Исполнителя, физическое или юридическое лицо, производящее акцепт этой оферты, становится Заказчиком (в соответствии с пунктом 3 статьи 438 ГК РФ акцепт оферты равносилен заключению договора на условиях, изложенных в оферте).
                            </p>
                            <p>
                                1.3. Моментом полного и безоговорочного принятия Заказчиком предложения Исполнителя заключить Договор-оферты (акцептом оферты) считается факт оплаты услуг Исполнителя в размере <b><?=$reseveSum?> (<?=$reseveSumText?>) рублей</b>, посредством перечисления денежных средств на расчетный счет Исполнителя по следующим реквизитам: <b>р/сч. 40702810555000039612, кор/сч. 30101810500000000653, Банк: СЕВЕРО-ЗАПАДНЫЙ БАНК ПАО СБЕРБАНК Г. САНКТ ПЕТЕРБУРГ, БИК 044030653</b>.
                            </p>
                            <p>
                                1.4. Осуществляя акцепт оферты по Договору в порядке, определенном в п. 1.3 Договора (оплачивая услуги Исполнителя), Заказчик подтверждает, что он ознакомлен и ему понятны условия Договора, полностью и безоговорочно принимает все условия Договора в том виде, в каком они изложены в тексте Договора.
                            </p>
                            <p>
                                1.5. Заказчик согласен, что акцепт Договора в порядке, определенном в п. 1.3 Договора, является заключением Договора на условиях, изложенных ниже.
                            </p>
                            <p>
                                1.6. Договор не требует скрепления печатями и/или подписания Заказчиком и Исполнителем (далее по тексту – Стороны) и имеет юридическую силу.
                            </p>
                            <p>
                                1.7. Для целей настоящего Договора под объектом недвижимости понимается нежилое помещение, права требования объекта долевого строительства и др., размещенные на сайте fsknw.ru и доступные для бронирования.
                            </p>
                            <p>
                                <b>&nbsp;</b>
                            </p>
                            <p>
                                <b>2. Предмет договора</b>
                            </p>
                            <p>
                                2.1. В соответствии с настоящим Договором Исполнитель обязуется оказать Заказчику на возмездной основе услуги по бронированию за Заказчиком выбранного им объекта недвижимости сроком на:<br>
                                - 5 (пять) рабочих дней – при намерении Заказчика приобрести объект недвижимости без использования кредитных денежных средств (за счет собственных средств);<br>
                                - 14 (четырнадцать) рабочих дней – при намерении Заказчика приобрести объект недвижимости с использованием кредитных денежных средств.<br>
                            </p>
                            <p>
                                2.1.1. На весь период бронирования фиксируется стоимость (цена) объекта недвижимости, выбранного Заказчиком на сайте fsknw.ru.
                            </p>
                            <p>
                                &nbsp;
                            </p>
                            <p>
                                <b>3. Права и обязанности Сторон</b>
                            </p>
                            <p>
                                3.1. Исполнитель обязуется:
                            </p>
                            <p>
                                3.1.1. Забронировать за Заказчиком на срок, указанный в п. 2.1 Договора, выбранный им на сайте fsknw.ru объект недвижимости.
                            </p>
                            <p>
                                3.1.2. В одностороннем порядке не изменять стоимость (цену) объекта недвижимости, забронированного Заказчиком на сайте fsknw.ru.
                            </p>
                            <p>
                                3.1.3. По запросу Заказчика, консультировать его относительно объекта недвижимости, забронированного Заказчиком на сайте fsknw.ru.
                            </p>
                            <p>
                                3.1.4. По запросу Заказчика, разъяснить Заказчику положения гражданско-правовых договоров, по которым правообладатель объекта недвижимости заключает сделки по его отчуждению. Под гражданско-правовыми договорами Стороны понимают предварительные договоры купли-продажи, договоры купли-продажи, договоры участия в долевом строительстве, договоры уступки права требования по договорам участия в долевом строительстве и иные договоры, направленные на отчуждение и (или) приобретение объекта недвижимости, предусмотренные законодательством Российской Федерации (далее – Договор реализации).
                            </p>
                            <p>
                                3.1.5. По запросу Заказчика, консультировать Заказчика относительно порядка, способа и срока оплаты стоимости (цены) объекта недвижимости в соответствии с формами Договоров реализации, используемых правообладателем объекта недвижимости, в т.ч. с использованием кредитных/заемных средств.
                            </p>
                            <p>
                                3.1.6. По запросу Заказчика, консультировать его относительно документов, необходимых и достаточных для заключения между Заказчиком и правообладателем объекта недвижимости Договора реализации, а также его государственной регистрации в органе регистрации прав.
                            </p>
                            <p>
                                3.2. Исполнитель вправе:
                            </p>
                            <p>
                                3.2.1. Привлекать для исполнения Договора третьих лиц.
                            </p>
                            <p>
                                3.3. Заказчик обязуется:
                            </p>
                            <p>
                                3.3.1. Обеспечить Исполнителя необходимой информацией, требующейся для надлежащего выполнения обязательств по Договору, в том числе предоставить копии паспорта, в случае необходимости, документов, подтверждающих семейное положение, и иных документов по требованию Исполнителя.
                            </p>
                            <p>
                                3.3.2. Своевременно и в полном объеме оплатить услуги Исполнителя.
                            </p>
                            <p>
                                3.3.3. Уведомлять Исполнителя об изменении своих реквизитов, в том числе адреса регистрации/места жительства, телефона, паспортных данных, адреса электронной почты.
                            </p>
                            <p>
                                3.3.4. Подавать заявки на одобрение кредита в банки, в которых аккредитован строящийся либо завершенный строительством объект капитального строительства, в котором расположен объект недвижимости, в соответствии со списком, предоставленным Заказчику Исполнителем.
                            </p>
                            <p>
                                3.3.5. В случае получения отказа кредитного комитета банка в выдаче (одобрении) кредита на приобретение Заказчиком забронированного объекта недвижимости, указанный отказ должен быть предоставлен Заказчиком Исполнителю любым не запрещенным действующим законодательством способом.
                            </p>
                            <p>
                                &nbsp;
                            </p>
                            <p>
                                <b>4.</b> <b>Порядок расчетов</b>
                            </p>
                            <p>
                                4.1.<b> </b>Стоимость услуги Исполнителя, указанной в п. 2.1 Договора, составляет <b><?=$reseveSum?> (<?=$reseveSumText?>) рублей</b>, (НДС не облагается в связи с применением УСН).
                            </p>
                            <p>
                                Заказчик обязуется произвести оплату услуги в момент заключения настоящего Договора.
                            </p>
                            <p>
                                4.2.<b> </b>Оплата производится Заказчиком путем перечисления денежных средств на расчетный счет Исполнителя, указанный в п. 1.3. Договора.
                            </p>
                            <p>
                                4.3. Стороны отдельно определили, что стоимость услуги Исполнителя, указанная в п.4.1 Договора, включает в себя оплату обязательств Исполнителя, поименованных в п. 3.1.1 и п.3.1.2. За исполнение Исполнителем обязанностей, указанных в п.п. 3.1.3 – 3.1.6 Договора, плата не взимается.
                            </p>
                            <p>
                                4.4. В подтверждение оплаты Заказчиком услуги Исполнителя и заключения настоящего Договора, в течение 1 (одного) рабочего дня с даты полной оплаты стоимости услуги, Исполнитель направляет Заказчику по номеру телефону и/или на адрес электронной почты, указанный (-ые) Заказчиком при бронировании объекта недвижимости на сайте fsknw.ru, отчет о выполнении (оказании) услуги Исполнителя (далее – отчет Исполнителя), с обязательным указанием номера бронирования, даты бронирования, объекта недвижимости, выбранного Заказчиком для бронирования, зафиксированная стоимость объекта недвижимости.
                            </p>
                            <p>
                                4.5. Стороны признают согласованным, что отчет Исполнителя является надлежащим и достаточным доказательством факта оказания услуг Исполнителя. Составление (подписание) иных документов не требуется.
                            </p>
                            <p>
                                4.6. Услуга, указанная в п. 2.1 Договора, считается оказанной Исполнителем Заказчику в день направления Заказчику Отчета Исполнителя в порядке, установленном в. 4.4 Договора.
                            </p>
                            <p>
                                &nbsp;
                            </p>
                            <p>
                                <b>5. Ответственность Сторон</b>
                            </p>
                            <p>
                                5.1. За невыполнение или ненадлежащее исполнение условий Договора Стороны несут ответственность в соответствии с действующим законодательством РФ.
                            </p>
                            <p>
                                5.2.<b> </b>Все споры и разногласия, которые могут возникнуть по Договору, Стороны разрешают путем переговоров и направления претензий, срок ответа на которые составляет 10 (десять) дней с момента получения претензии, а при не достижении согласия в течение 20 (Двадцати) рабочих дней, споры передаются на рассмотрение в суд по месту нахождения Исполнителя.
                            </p>
                            <p>
                                &nbsp;
                            </p>
                            <p>
                                <b>6. Срок действия договора</b>
                            </p>
                            <p>
                                6.1. Настоящий Договор действует до полного исполнения Сторонами принятых на себя обязательств.
                            </p>
                            <p>
                                <b>&nbsp;</b>
                            </p>
                            <p>
                                <b>7. Прочие условия</b>
                            </p>
                            <p>
                                7.1. В случае неподписания /незаключения Заказчиком (либо иным лицом по указанию Заказчика) по основаниям, не связанными с действиями /бездействием Исполнителя, в срок, указанный в п. 2.1 Договора, Договора реализации в отношении объекта недвижимости, выбранного Заказчиком на сайте fsknw.ru и забронированного для него Исполнителем в соответствии с условиями настоящего Договора, денежные средства, оплаченные за фактически оказанные Исполнителем услуги, возврату не подлежат.
                            </p>
                            <p>
                                7.1.1. В случае получения Заказчиком отказа Банка, выбранного Заказчиком с учетом условий п. 3.3.4. Договора, в получении кредита для приобретения объекта недвижимости, либо в случае одобрения Банком суммы кредита меньше той суммы, которую Заказчик запрашивал в Банке, Исполнитель осуществляет возврат Заказчику Стоимости услуги в полном объеме. Возврат осуществляется по письменному заявлению Заказчика. Возврат осуществляется в течение 30 (Тридцати) рабочих дней с момента получения от Заказчика соответствующего заявления и предоставления копии документа либо иной информации, свидетельствующих об отказе Заказчику в выдаче кредита Банком на приобретение объекта недвижимости.
                            </p>
                            <p>
                                7.1.2. При этом Стороны особо оговорили, что, при наличии одного одобрения из списка банков, в которых аккредитован строящийся либо завершенный строительством объект капитального строительства, в котором расположен объект недвижимости, на всю запрошенную сумму кредита, и отказа Заказчика (либо иным лицом по указанию Заказчика) от заключения им (или иным лицом по указанию Заказчика) Договора реализации в отношении забронированного объекта недвижимости, в срок, указанный в п. 2.1 Договора, денежные средства, оплаченные за фактически оказанные Исполнителем услуги, возврату не подлежат.
                            </p>
                            <p>
                                7.1.3. Пункты 7.1.1 – 7.1.2 Договора применяются при намерении Заказчика приобрести забронированный объект недвижимости с использованием кредитных средств.
                            </p>
                            <p>
                                7.2. Заказчик уведомлен Исполнителем, что приобретение Заказчиком (или иным лицом по указанию Заказчика) объекта недвижимости, выбранного Заказчиком на сайте fsknw.ru и забронированного для него Исполнителем в соответствии с условиями настоящего Договора, осуществляется в срок, указанный в п. 2.1. Договора, при условии заключения Заказчиком (или иным лицом по указанию Заказчиком) с ООО «Апарт-Сервис» (ОГРН&nbsp;1197847063743, ИНН&nbsp;7813632658) Договора оказания услуг управления и Агентского договора на оснащение в отношении данного объекта недвижимости.
                            </p>
                            <p>
                                В случае незаключения Заказчиком (или иным лицом по указанию Заказчика) с ООО «Апарт-Сервис» (ОГРН&nbsp;1197847063743, ИНН&nbsp;7813632658) Договора оказания услуг управления и Агентского договора на оснащение в отношении объекта недвижимости, выбранного Заказчиком на сайте fsknw.ru и забронированного для него Исполнителем, заключение Договора реализации в отношении данного объекта недвижимости не производится и денежные средства, оплаченные за фактически оказанные Исполнителем услуги, возврату не подлежат.
                            </p>
                            <p>
                                7.3. Во всем остальном, что не предусмотрено Договором, Стороны руководствуются действующим законодательством РФ.
                            </p>
                            <p>
                                7.4 Заказчик настоящим подтверждает, что до заключения (акцептования) он внимательно прочитал настоящий Договор (условия оферты) и полностью уяснил для себя его смысл и значение.
                            </p>
                            <table cellspacing="0" cellpadding="0" style="border-collapse: collapse;">
                                <tbody>
                                <tr>
                                    <td>
                                        <p>
                                            <b>&nbsp;</b>
                                        </p>
                                        <p>
                                            <b>&nbsp;&nbsp;&nbsp; ИСПОЛНИТЕЛЬ:</b>
                                        </p>
                                        <p>
                                            <b>Общество с ограниченной ответственностью «Агентство недвижимости «ФСК Северо-Запад» (ООО «АН «ФСК Северо-Запад»), </b>адрес: 197198, г. Санкт-Петербург, Большой пр. П.С., д. 48, лит. А, пом. 2-Н, офис 106, ИНН/КПП 7813627626/781301001, ОГРН 1187847371095, р/сч 40702810555000039612, кор/сч 30101810500000000653, Банк: СЕВЕРО-ЗАПАДНЫЙ БАНК ПАО СБЕРБАНК Г. САНКТ-ПЕТЕРБУРГ, БИК 044030653
                                        </p>
                                    </td>
                                </tr>
                                </tbody>
                            </table>
                        </div>
                        <?
                    }elseif ($object['PROPERTIES']['rooms']['VALUE']>1 && ($lk == 'komendantskiy' || $lk=='pushkinskiy')){
                        if ($lk=='pushkinskiy'){
                            ?>
                            <?=$dopText?>
                            <div class="about-bron">
                                <div class="about-bron-text">
                                    <p>
                                        <strong class="about-bron-text__title">Основные условия бронирования:</strong>
                                        1. Стоимость бронирования составляет <?=$reseveSum?> руб. Это сумма в дальнейшем включается в стоимость <?=$objectType[$object['PROPERTIES']['category']['VALUE']][1]?>.
                                    </p>
                                    <p>
                                        2. Бронирование подразумевает фиксацию стоимости на момент оплаты бронирования, а также закрепление данного объекта за вами на срок:<br>
                                        - при 100% оплате 5 дней.<br>
                                        - при ипотеке 14 дней.<br>
                                    </p>
                                    <p>
                                        3. При оформлении онлайн-бронирования предоставляется скидка в 1% от стоимости, суммируется с прочими скидками и спецпредложениями.
                                    </p>
                                    <p>
                                        4. При бронировании выбранного Вами объекта недвижимости вы бронируете одновременно покупку кладовой в соответствии с условиями оферты.
                                    </p>
                                </div>
                                <svg class="about-bron__svg" width="108" height="108" viewBox="0 0 108 108" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M86.9062 28.6875C86.9062 29.8518 87.8513 30.7969 89.0156 30.7969C90.1799 30.7969 91.125 29.8518 91.125 28.6875C91.125 27.5232 90.1799 26.5781 89.0156 26.5781C87.8513 26.5781 86.9062 27.5232 86.9062 28.6875Z" fill="#D7D7D7"/>
                                    <path d="M95.3431 54.0008C95.3431 56.7027 95.072 59.3995 94.5381 62.0165C94.3049 63.1577 95.0415 64.2717 96.1827 64.5049C96.3253 64.5345 96.467 64.5485 96.6071 64.5485C97.5884 64.5485 98.4676 63.8589 98.672 62.8602C99.2628 59.9656 99.5619 56.9853 99.5619 54.0008C99.5619 47.3588 98.1216 40.9672 95.2797 35.0033C94.7787 33.9519 93.5205 33.5053 92.4683 34.0063C91.416 34.5072 90.9703 35.7663 91.4712 36.8185C94.0404 42.2106 95.3431 47.9916 95.3431 54.0008Z" fill="#D7D7D7"/>
                                    <path d="M64.5469 72.9844H62.4375V45.5625C62.4375 44.3974 61.4932 43.4531 60.3281 43.4531H43.4531C42.288 43.4531 41.3438 44.3974 41.3438 45.5625V54C41.3438 55.1651 42.288 56.1094 43.4531 56.1094H45.5625V72.9844H43.4531C42.288 72.9844 41.3438 73.9286 41.3438 75.0938V83.5312C41.3438 84.6964 42.288 85.6406 43.4531 85.6406H64.5469C65.712 85.6406 66.6562 84.6964 66.6562 83.5312V75.0938C66.6562 73.9286 65.712 72.9844 64.5469 72.9844ZM62.4375 81.4219H45.5625V77.2031H47.6719C48.837 77.2031 49.7812 76.2589 49.7812 75.0938V54C49.7812 52.8349 48.837 51.8906 47.6719 51.8906H45.5625V47.6719H58.2188V75.0938C58.2188 76.2589 59.1638 77.2031 60.3281 77.2031H62.4375V81.4219Z" fill="#D7D7D7"/>
                                    <path d="M54 39.2344C58.6522 39.2344 62.4375 35.449 62.4375 30.7969C62.4375 26.1447 58.6522 22.3594 54 22.3594C49.3478 22.3594 45.5625 26.1447 45.5625 30.7969C45.5625 35.449 49.3478 39.2344 54 39.2344ZM54 26.5781C56.3261 26.5781 58.2188 28.4708 58.2188 30.7969C58.2188 33.123 56.3261 35.0156 54 35.0156C51.6739 35.0156 49.7812 33.123 49.7812 30.7969C49.7812 28.4708 51.6739 26.5781 54 26.5781Z" fill="#D7D7D7"/>
                                    <path d="M54.0001 0C24.8957 0 9.19855e-05 24.8486 9.19855e-05 54C9.19855e-05 63.9577 2.85352 74.5475 7.6647 82.5573L0.108033 105.224C-0.144104 105.981 0.0528264 106.818 0.618073 107.382C1.18579 107.95 2.02295 108.143 2.77689 107.891L25.4436 100.335C33.4526 105.147 44.0424 108 54.0001 108C83.1119 108 108 83.1481 108 54C108 24.8882 83.149 0 54.0001 0V0ZM54.0001 103.781C44.4478 103.781 34.2947 100.962 26.8402 96.2411C26.3121 95.9065 25.6537 95.8184 25.044 96.0219L5.44492 102.555L11.9782 82.9561C12.1793 82.3546 12.0985 81.6954 11.759 81.1599C7.03766 73.7062 4.21884 63.5523 4.21884 54C4.21884 27.0157 27.0157 4.21875 54.0001 4.21875C80.9844 4.21875 103.781 27.0157 103.781 54C103.781 80.9843 80.9844 103.781 54.0001 103.781Z" fill="#D7D7D7"/>
                                </svg>
                            </div>
                            <h2 class="h1 title">Договор оферта</h2>
                            <div>
                                <p>
                                    <b> 1. Общие положения</b>
                                </p>
                                <p>
                                    1.1. Настоящий Договор-оферта (далее – Договор) является официальным предложением (публичной офертой)<b> Общества с ограниченной ответственностью «Агентство недвижимости «ФСК Северо-Запад» (ООО «АН «ФСК Северо-Запад»)</b>, ОГРН: 1187847371095, ИНН/КПП 7813627626/781301001, зарегистрировано Межрайонной инспекцией Федеральной налоговой службы №15 по Санкт-Петербургу 10.12.2018, адрес: 197198, г. Санкт-Петербург, Большой пр. П.С., д. 48, лит. А, пом. 2-Н, офис 106, в лице генерального директора Межевской Анастасии Ивановны, действующей на основании Устава, именуемое в дальнейшем «Исполнитель», <i>для полностью дееспособных физических лиц и юридических лиц</i>, которые примут настоящее предложение на указанных ниже условиях.
                                </p>
                                <p>
                                    1.2. В соответствии с пунктом 2 статьи 437 Гражданского кодекса Российской Федерации (далее – ГК РФ) в случае принятия изложенных ниже условий и оплаты услуг Исполнителя, физическое или юридическое лицо, производящее акцепт этой оферты, становится Заказчиком (в соответствии с пунктом 3 статьи 438 ГК РФ акцепт оферты равносилен заключению договора на условиях, изложенных в оферте).
                                </p>
                                <p>
                                    1.3. Моментом полного и безоговорочного принятия Заказчиком предложения Исполнителя заключить Договор-оферты (акцептом оферты) считается факт оплаты услуг Исполнителя в размере <b><?=$reseveSum?> (<?=$reseveSumText?>) рублей</b>, посредством перечисления денежных средств на расчетный счет Исполнителя по следующим реквизитам: <b>р/сч. 40702810555000039612, кор/сч. 30101810500000000653, Банк: СЕВЕРО-ЗАПАДНЫЙ БАНК ПАО СБЕРБАНК Г. САНКТ ПЕТЕРБУРГ, БИК 044030653</b>.
                                </p>
                                <p>
                                    1.4. Осуществляя акцепт оферты по Договору в порядке, определенном в п. 1.3 Договора (оплачивая услуги Исполнителя), Заказчик подтверждает, что он ознакомлен и ему понятны условия Договора, полностью и безоговорочно принимает все условия Договора в том виде, в каком они изложены в тексте Договора.
                                </p>
                                <p>
                                    1.5. Заказчик согласен, что акцепт Договора в порядке, определенном в п. 1.3 Договора, является заключением Договора на условиях, изложенных ниже.
                                </p>
                                <p>
                                    1.6. Договор не требует скрепления печатями и/или подписания Заказчиком и Исполнителем (далее по тексту – Стороны) и имеет юридическую силу.
                                </p>
                                <p>
                                    1.7. Для целей настоящего Договора под объектом недвижимости понимается квартира, нежилое помещение, машино-место, права требования объекта долевого строительства и др., размещенные на сайте fsknw.ru и доступные для бронирования.
                                </p>
                                <p>
                                    <b>&nbsp;</b>
                                </p>
                                <p>
                                    <b>2. Предмет договора</b>
                                </p>
                                <p>
                                    2.1. В соответствии с настоящим Договором Исполнитель обязуется оказать Заказчику на возмездной основе услугу по бронированию за Заказчиком выбранного им объекта недвижимости сроком на:
                                </p>
                                <p>
                                    - <b>5 (пять) рабочих дней</b> – при намерении Заказчика приобрести объект недвижимости без использования кредитных денежных средств (за счет собственных средств);
                                </p>
                                <p>
                                    - <b>14 (четырнадцать) рабочих дней</b> – при намерении Заказчика приобрести объект недвижимости с использованием кредитных денежных средств.
                                </p>
                                <p>
                                    2.1.1. На весь период бронирования фиксируется стоимость (цена) объекта недвижимости, выбранного Заказчиком на сайте fsknw.ru.
                                </p>
                                <p>
                                    &nbsp;
                                </p>
                                <p>
                                    <b>3. Права и обязанности Сторон</b>
                                </p>
                                <p>
                                    3.1. Исполнитель обязуется:
                                </p>
                                <p>
                                    3.1.1. Забронировать за Заказчиком на срок, указанный в п. 2.1 Договора, выбранный им на сайте fsknw.ru объект недвижимости.
                                </p>
                                <p>
                                    3.1.2. В одностороннем порядке не изменять стоимость (цену) объекта недвижимости, забронированного Заказчиком на сайте fsknw.ru.
                                </p>
                                <p>
                                    3.1.3. По запросу Заказчика, консультировать его относительно объекта недвижимости, забронированного Заказчиком на сайте fsknw.ru.
                                </p>
                                <p>
                                    3.1.4. По запросу Заказчика, разъяснить Заказчику положения гражданско-правовых договоров, по которым правообладатель объекта недвижимости заключает сделки по его отчуждению. Под гражданско-правовыми договорами Стороны понимают предварительные договоры купли-продажи, договоры купли-продажи, договоры участия в долевом строительстве, договоры уступки права требования по договорам участия в долевом строительстве и иные договоры, направленные на отчуждение и (или) приобретение объекта недвижимости, предусмотренные законодательством Российской Федерации (далее – Договор реализации).
                                </p>
                                <p>
                                    3.1.5. По запросу Заказчика, консультировать Заказчика относительно порядка, способа и срока оплаты стоимости (цены) объекта недвижимости в соответствии с формами Договоров реализации, используемых правообладателем объекта недвижимости, в т.ч. с использованием кредитных/заемных средств, средств материнского (семейного) капитала, субсидий.
                                </p>
                                <p>
                                    3.1.6. По запросу Заказчика, консультировать его относительно документов, необходимых и достаточных для заключения между Заказчиком и правообладателем объекта недвижимости Договора реализации, а также его государственной регистрации в органе регистрации прав.
                                </p>
                                <p>
                                    3.2. Исполнитель вправе:
                                </p>
                                <p>
                                    3.2.1. Привлекать для исполнения Договора третьих лиц.
                                </p>
                                <p>
                                    3.3. Заказчик обязуется:
                                </p>
                                <p>
                                    3.3.1. Обеспечить Исполнителя необходимой информацией, требующейся для надлежащего выполнения обязательств по Договору, в том числе предоставить копии паспорта, в случае необходимости, документов, подтверждающих семейное положение, и иных документов по требованию Исполнителя.
                                </p>
                                <p>
                                    3.3.2. Своевременно и в полном объеме оплатить услуги Исполнителя.
                                </p>
                                <p>
                                    3.3.3. Уведомлять Исполнителя об изменении своих реквизитов, в том числе адреса регистрации/места жительства, телефона, паспортных данных, адреса электронной почты.
                                </p>
                                <p>
                                    3.3.4. Подавать заявки на одобрение кредита в банки, в которых аккредитован строящийся либо завершенный строительством объект капитального строительства, в котором расположен объект недвижимости, в соответствии со списком, предоставленным Заказчику Исполнителем.
                                </p>
                                <p>
                                    3.3.5. В случае получения отказа кредитного комитета банка в выдаче (одобрении) кредита на приобретение Заказчиком забронированного объекта недвижимости, указанный отказ должен быть предоставлен Заказчиком Исполнителю любым не запрещенным действующим законодательством способом.
                                </p>
                                <p>
                                    &nbsp;
                                </p>
                                <p>
                                    <b>4.</b> <b>Порядок расчетов</b>
                                </p>
                                <p>
                                    4.1.<b> </b>Стоимость услуги Исполнителя, указанной в п. 2.1 Договора, составляет <b><?=$reseveSum?> (<?=$reseveSumText?>) рублей</b>,<b> </b>(НДС не облагается в связи с применением УСН).
                                </p>
                                <p>
                                    Заказчик обязуется произвести оплату услуги в момент заключения настоящего Договора.
                                </p>
                                <p>
                                    4.2.<b> </b>Оплата производится Заказчиком путем перечисления денежных средств на расчетный счет Исполнителя, указанный в п. 1.3. Договора.
                                </p>
                                <p>
                                    4.3. Стороны отдельно определили, что стоимость услуги Исполнителя, указанная в п.4.1 Договора, включает в себя оплату обязательств Исполнителя, поименованных в п. 3.1.1 и п.3.1.2. За исполнение Исполнителем обязанностей, указанных в п.п. 3.1.3 – 3.1.6 Договора, плата не взимается.
                                </p>
                                <p>
                                    4.4. В подтверждение оплаты Заказчиком услуги Исполнителя и заключения настоящего Договора, в течение 1 (одного) рабочего дня с даты полной оплаты стоимости услуги, Исполнитель направляет Заказчику по номеру телефону и/или на адрес электронной почты, указанный (-ые) Заказчиком при бронировании объекта недвижимости на сайте fsknw.ru, отчет о выполнении (оказании) услуги Исполнителя (далее – отчет Исполнителя), с обязательным указанием номера бронирования, даты бронирования, объекта недвижимости, выбранного Заказчиком для бронирования, зафиксированная стоимость объекта недвижимости.
                                </p>
                                <p>
                                    4.5. Стороны признают согласованным, что отчет Исполнителя является надлежащим и достаточным доказательством факта оказания Исполнителем услуги. Составление (подписание) иных документов не требуется.
                                </p>
                                <p>
                                    4.6. Услуга, указанная в п. 2.1 Договора, считается оказанной Исполнителем Заказчику в день направления Заказчику Отчета Исполнителя в порядке, установленном в. 4.4 Договора.
                                </p>
                                <p>
                                    &nbsp;
                                </p>
                                <p>
                                    <b>5. Ответственность Сторон</b>
                                </p>
                                <p>
                                    5.1. За невыполнение или ненадлежащее исполнение условий Договора Стороны несут ответственность в соответствии с действующим законодательством РФ.
                                </p>
                                <p>
                                    5.2.<b> </b>Все споры и разногласия, которые могут возникнуть по Договору, Стороны разрешают путем переговоров и направления претензий, срок ответа на которые составляет 10 (десять) дней с момента получения претензии, а при не достижении согласия в течение 20 (Двадцати) рабочих дней, споры передаются на рассмотрение в суд по месту нахождения Исполнителя.
                                </p>
                                <p>
                                    &nbsp;
                                </p>
                                <p>
                                    <b>6. Срок действия договора</b>
                                </p>
                                <p>
                                    6.1. Настоящий Договор действует до полного исполнения Сторонами принятых на себя обязательств.
                                </p>
                                <p>
                                    <b>&nbsp;</b>
                                </p>
                                <p>
                                    <b>7. Прочие условия</b>
                                </p>
                                <p>
                                    7.1. В случае неподписания /незаключения Заказчиком (либо иным лицом по указанию Заказчика) по основаниям, не связанными с действиями /бездействием Исполнителя, в срок, указанный в п. 2.1 Договора, Договора реализации в отношении объекта недвижимости, выбранного Заказчиком на сайте fsknw.ru и забронированного для него Исполнителем в соответствии с условиями настоящего Договора, денежные средства, оплаченные за фактически оказанные Исполнителем услуги, возврату не подлежат.
                                </p>
                                <p>
                                    7.1.1. В случае получения Заказчиком отказа Банка, выбранного Заказчиком с учетом условий п. 3.3.4. Договора, в получении кредита для приобретения забронированного объекта недвижимости, либо в случае одобрения Банком суммы кредита меньше той суммы, которую Заказчик запрашивал в Банке, Исполнитель осуществляет возврат Заказчику Стоимости услуг в полном объеме. Возврат осуществляется по письменному заявлению Заказчика. Возврат осуществляется в течение 30 (Тридцати) рабочих дней с момента получения от Заказчика соответствующего заявления и предоставления копии документа либо иной информации, свидетельствующих об отказе Заказчику в выдаче кредита Банком на приобретение забронированного объекта недвижимости.
                                </p>
                                <p>
                                    7.1.2. При этом Стороны особо оговорили, что, при наличии одного одобрения из списка банков, в которых аккредитован строящийся либо завершенный строительством объект капитального строительства, в котором расположен забронированный объект недвижимости, на всю запрошенную сумму кредита, и отказа Заказчиком (либо иным лицом по указанию Заказчика) от заключения Договора реализации в отношении забронированного объекта недвижимости, в срок, указанный в п. 2.1. Договора, денежные средства, оплаченные за фактически оказанные Исполнителем услуги, возврату не подлежат.
                                </p>
                                <p>
                                    7.1.3. Пункты 7.1.1 – 7.1.2 Договора применяются при намерении Заказчика приобрести забронированный объект недвижимости с использованием кредитных средств.
                                </p>
                                <p>
                                    7.2. При бронировании Заказчиком 2 (двух) или 3 (трех) комнатной квартиры, в т.ч. права требования объекта долевого строительства, являющегося 2 (двух) или 3 (трех) комнатной квартирой, Заказчик принимает на себя обязательство по приобретению (покупке) нежилого помещения (кладовой), расположенного в том же объекте капитального строительства, в котором расположен выбранный Заказчиком на сайте fsknw.ru и забронированный для него Исполнителем объект недвижимости (далее – кладовая), за цену, которая должна быть сообщена Исполнителем Заказчику в течение 2 (двух) рабочих дней после заключения настоящего Договора по номеру телефону и/или на адрес электронной почты, указанный (-ые) Заказчиком при бронировании объекта недвижимости на сайте fsknw.ru.
                                </p>
                                <p>
                                    7.2.1. При несогласии Заказчика с ценой кладовой, сообщенной Исполнителем Заказчику в соответствии с п. 7.2 Договора, настоящий Договор автоматически расторгается в момент получения Исполнителем от Заказчика сообщения/ уведомления об отказе от приобретения кладовой за цену, предложенную Исполнителем.
                                </p>
                                <p>
                                    7.2.1.1. Сообщение/ уведомление об отказе от приобретения кладовой за цену, предложенную Исполнителем, должно быть направлено Заказчиком Исполнителю в течение 2 (двух) рабочих дней с даты сообщения Исполнителем Заказчику цены кладовой в соответствии с п. 7.2 Договора.
                                </p>
                                <p>
                                    7.2.1.2. В случае непоступления Исполнителю от Заказчика сообщения/ уведомления об отказе от приобретения кладовой за цену, предложенную Исполнителем, цена кладовой считается принятой Заказчиком (согласованной Сторонами) и расторжение настоящего Договора по основанию, указанному в п. 7.2.1 Договора, не допускается.
                                </p>
                                <p>
                                    7.2.1.3. При расторжении настоящего Договора в соответствии с п. 7.2.1 Договора, возврат стоимости услуг Исполнителя в размере <?=$reseveSum?> (<?=$reseveSumText?>) рублей осуществляется в течение 30 (тридцати) рабочих дней с даты получения Исполнителем от Заказчика заявления о возврате денежных средств с указанием банковских реквизитов для перечисления.
                                </p>
                                <p>
                                    7.2.2. Заказчик уведомлен Исполнителем, что заключение/ подписание Договора реализации в отношении объекта недвижимости, выбранного Заказчиком на сайте fsknw.ru и забронированного для него Исполнителем в соответствии с условиями настоящего Договора, осуществляется в срок, указанный в п. 2.1 Договора, при условии заключения Заказчиком Договора реализации в отношении кладовой.
                                </p>
                                <p>
                                    7.2.3. В случае незаключения/ неподписания Заказчиком Договора реализации в отношении кладовой, заключение Договора реализации в отношении объекта недвижимости, выбранного Заказчиком на сайте fsknw.ru и забронированного для него Исполнителем, не производится, и денежные средства, оплаченные за фактически оказанные Исполнителем услуги, возврату не подлежат.
                                </p>
                                <p>
                                    7.3. Во всем остальном, что не предусмотрено Договором, Стороны руководствуются действующим законодательством РФ.
                                </p>
                                <p>
                                    7.4 Заказчик настоящим подтверждает, что до заключения (акцептования) он внимательно прочитал настоящий Договор (условия оферты) и полностью уяснил для себя его смысл и значение.
                                </p>
                                <p>
                                    &nbsp;
                                </p>
                                <table cellspacing="0" cellpadding="0" style="border-collapse: collapse;">
                                    <tbody>
                                    <tr>
                                        <td>
                                            <p>
                                                <b>&nbsp;&nbsp;&nbsp; ИСПОЛНИТЕЛЬ:</b>
                                            </p>
                                            <p>
                                                <b>&nbsp;</b>
                                            </p>
                                            <p>
                                                <b>Общество с ограниченной ответственностью «Агентство недвижимости «ФСК Северо-Запад» (ООО «АН «ФСК Северо-Запад»), </b>адрес: 197198, г. Санкт-Петербург, Большой пр. П.С., д. 48, лит. А, пом. 2-Н, офис 106, ИНН/КПП 7813627626/781301001, ОГРН 1187847371095, р/сч 40702810555000039612, кор/сч 30101810500000000653, Банк: СЕВЕРО-ЗАПАДНЫЙ БАНК ПАО СБЕРБАНК Г. САНКТ-ПЕТЕРБУРГ, БИК 044030653
                                            </p>
                                        </td>
                                    </tr>
                                    </tbody>
                                </table>
                            </div>

                            <?
                        }else{
                            ?>
                            <?=$dopText?>
                            <div class="about-bron">
                                <div class="about-bron-text">
                                    <p>
                                        <strong class="about-bron-text__title">Основные условия бронирования:</strong>
                                        1. Стоимость бронирования составляет <?=$reseveSum?> руб. Это сумма в дальнейшем включается в стоимость <?=$objectType[$object['PROPERTIES']['category']['VALUE']][1]?>.
                                    </p>
                                    <p>
                                        2. Бронирование подразумевает фиксацию стоимости на момент оплаты бронирования, а также закрепление данного объекта за вами на срок:<br>
                                        - при 100% оплате 5 дней.<br>
                                        - при ипотеке 14 дней.<br>
                                    </p>
                                    <p>
                                        3. При оформлении онлайн-бронирования предоставляется скидка в 1% от стоимости, суммируется с прочими скидками и спецпредложениями.
                                    </p>
                                    <p>
                                        4. При бронировании выбранного Вами объекта недвижимости вы бронируете одновременно покупку паркинга в соответствии с условиями оферты.
                                    </p>
                                </div>
                                <svg class="about-bron__svg" width="108" height="108" viewBox="0 0 108 108" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M86.9062 28.6875C86.9062 29.8518 87.8513 30.7969 89.0156 30.7969C90.1799 30.7969 91.125 29.8518 91.125 28.6875C91.125 27.5232 90.1799 26.5781 89.0156 26.5781C87.8513 26.5781 86.9062 27.5232 86.9062 28.6875Z" fill="#D7D7D7"/>
                                    <path d="M95.3431 54.0008C95.3431 56.7027 95.072 59.3995 94.5381 62.0165C94.3049 63.1577 95.0415 64.2717 96.1827 64.5049C96.3253 64.5345 96.467 64.5485 96.6071 64.5485C97.5884 64.5485 98.4676 63.8589 98.672 62.8602C99.2628 59.9656 99.5619 56.9853 99.5619 54.0008C99.5619 47.3588 98.1216 40.9672 95.2797 35.0033C94.7787 33.9519 93.5205 33.5053 92.4683 34.0063C91.416 34.5072 90.9703 35.7663 91.4712 36.8185C94.0404 42.2106 95.3431 47.9916 95.3431 54.0008Z" fill="#D7D7D7"/>
                                    <path d="M64.5469 72.9844H62.4375V45.5625C62.4375 44.3974 61.4932 43.4531 60.3281 43.4531H43.4531C42.288 43.4531 41.3438 44.3974 41.3438 45.5625V54C41.3438 55.1651 42.288 56.1094 43.4531 56.1094H45.5625V72.9844H43.4531C42.288 72.9844 41.3438 73.9286 41.3438 75.0938V83.5312C41.3438 84.6964 42.288 85.6406 43.4531 85.6406H64.5469C65.712 85.6406 66.6562 84.6964 66.6562 83.5312V75.0938C66.6562 73.9286 65.712 72.9844 64.5469 72.9844ZM62.4375 81.4219H45.5625V77.2031H47.6719C48.837 77.2031 49.7812 76.2589 49.7812 75.0938V54C49.7812 52.8349 48.837 51.8906 47.6719 51.8906H45.5625V47.6719H58.2188V75.0938C58.2188 76.2589 59.1638 77.2031 60.3281 77.2031H62.4375V81.4219Z" fill="#D7D7D7"/>
                                    <path d="M54 39.2344C58.6522 39.2344 62.4375 35.449 62.4375 30.7969C62.4375 26.1447 58.6522 22.3594 54 22.3594C49.3478 22.3594 45.5625 26.1447 45.5625 30.7969C45.5625 35.449 49.3478 39.2344 54 39.2344ZM54 26.5781C56.3261 26.5781 58.2188 28.4708 58.2188 30.7969C58.2188 33.123 56.3261 35.0156 54 35.0156C51.6739 35.0156 49.7812 33.123 49.7812 30.7969C49.7812 28.4708 51.6739 26.5781 54 26.5781Z" fill="#D7D7D7"/>
                                    <path d="M54.0001 0C24.8957 0 9.19855e-05 24.8486 9.19855e-05 54C9.19855e-05 63.9577 2.85352 74.5475 7.6647 82.5573L0.108033 105.224C-0.144104 105.981 0.0528264 106.818 0.618073 107.382C1.18579 107.95 2.02295 108.143 2.77689 107.891L25.4436 100.335C33.4526 105.147 44.0424 108 54.0001 108C83.1119 108 108 83.1481 108 54C108 24.8882 83.149 0 54.0001 0V0ZM54.0001 103.781C44.4478 103.781 34.2947 100.962 26.8402 96.2411C26.3121 95.9065 25.6537 95.8184 25.044 96.0219L5.44492 102.555L11.9782 82.9561C12.1793 82.3546 12.0985 81.6954 11.759 81.1599C7.03766 73.7062 4.21884 63.5523 4.21884 54C4.21884 27.0157 27.0157 4.21875 54.0001 4.21875C80.9844 4.21875 103.781 27.0157 103.781 54C103.781 80.9843 80.9844 103.781 54.0001 103.781Z" fill="#D7D7D7"/>
                                </svg>
                            </div>
                            <h2 class="h1 title">Договор оферта</h2>
                            <div>
                                <p>
                                    <b>1. Общие положения</b>
                                </p>
                                <p>
                                    1.1. Настоящий Договор-оферта (далее – Договор) является официальным предложением (публичной офертой)<b> Общества с ограниченной ответственностью «Агентство недвижимости «ФСК Северо-Запад» (ООО «АН «ФСК Северо-Запад»)</b>, ОГРН: 1187847371095, ИНН/КПП 7813627626/781301001, зарегистрировано Межрайонной инспекцией Федеральной налоговой службы №15 по Санкт-Петербургу 10.12.2018, адрес: 197198, г. Санкт-Петербург, Большой пр. П.С., д. 48, лит. А, пом. 2-Н, офис 106, в лице генерального директора Межевской Анастасии Ивановны, действующей на основании Устава, именуемое в дальнейшем «Исполнитель», <i>для полностью дееспособных физических лиц и юридических лиц</i>, которые примут настоящее предложение на указанных ниже условиях.
                                </p>
                                <p>
                                    1.2. В соответствии с пунктом 2 статьи 437 Гражданского кодекса Российской Федерации (далее – ГК РФ) в случае принятия изложенных ниже условий и оплаты услуг Исполнителя, физическое или юридическое лицо, производящее акцепт этой оферты, становится Заказчиком (в соответствии с пунктом 3 статьи 438 ГК РФ акцепт оферты равносилен заключению договора на условиях, изложенных в оферте).
                                </p>
                                <p>
                                    1.3. Моментом полного и безоговорочного принятия Заказчиком предложения Исполнителя заключить Договор-оферты (акцептом оферты) считается факт оплаты услуг Исполнителя в размере <b><?=$reseveSum?> (<?=$reseveSumText?>) рублей</b>, посредством перечисления денежных средств на расчетный счет Исполнителя по следующим реквизитам: <b>р/сч. 40702810555000039612, кор/сч. 30101810500000000653, Банк: СЕВЕРО-ЗАПАДНЫЙ БАНК ПАО СБЕРБАНК Г. САНКТ ПЕТЕРБУРГ, БИК 044030653</b>.
                                </p>
                                <p>
                                    1.4. Осуществляя акцепт оферты по Договору в порядке, определенном в п. 1.3 Договора (оплачивая услуги Исполнителя), Заказчик подтверждает, что он ознакомлен и ему понятны условия Договора, полностью и безоговорочно принимает все условия Договора в том виде, в каком они изложены в тексте Договора.
                                </p>
                                <p>
                                    1.5. Заказчик согласен, что акцепт Договора в порядке, определенном в п. 1.3 Договора, является заключением Договора на условиях, изложенных ниже.
                                </p>
                                <p>
                                    1.6. Договор не требует скрепления печатями и/или подписания Заказчиком и Исполнителем (далее по тексту – Стороны) и имеет юридическую силу.
                                </p>
                                <p>
                                    1.7. Для целей настоящего Договора под объектом недвижимости понимается квартира, нежилое помещение, машино-место, права требования объекта долевого строительства и др., размещенные на сайте fsknw.ru и доступные для бронирования.
                                </p>
                                <p>
                                    <b>&nbsp;</b>
                                </p>
                                <p>
                                    <b>2. Предмет договора</b>
                                </p>
                                <p>
                                    2.1. В соответствии с настоящим Договором Исполнитель обязуется оказать Заказчику на возмездной основе услугу по бронированию за Заказчиком выбранного им объекта недвижимости сроком на:
                                </p>
                                <p>
                                    - <b>5 (пять) рабочих дней</b> – при намерении Заказчика приобрести объект недвижимости без использования кредитных денежных средств (за счет собственных средств);
                                </p>
                                <p>
                                    - <b>14 (четырнадцать) рабочих дней</b> – при намерении Заказчика приобрести объект недвижимости с использованием кредитных денежных средств.
                                </p>
                                <p>
                                    2.1.1. На весь период бронирования фиксируется стоимость (цена) объекта недвижимости, выбранного Заказчиком на сайте fsknw.ru.
                                </p>
                                <p>
                                    &nbsp;
                                </p>
                                <p>
                                    <b>3. Права и обязанности Сторон</b>
                                </p>
                                <p>
                                    3.1. Исполнитель обязуется:
                                </p>
                                <p>
                                    3.1.1. Забронировать за Заказчиком на срок, указанный в п. 2.1 Договора, выбранный им на сайте fsknw.ru объект недвижимости.
                                </p>
                                <p>
                                    3.1.2. В одностороннем порядке не изменять стоимость (цену) объекта недвижимости, забронированного Заказчиком на сайте fsknw.ru.
                                </p>
                                <p>
                                    3.1.3. По запросу Заказчика, консультировать его относительно объекта недвижимости, забронированного Заказчиком на сайте fsknw.ru.
                                </p>
                                <p>
                                    3.1.4. По запросу Заказчика, разъяснить Заказчику положения гражданско-правовых договоров, по которым правообладатель объекта недвижимости заключает сделки по его отчуждению. Под гражданско-правовыми договорами Стороны понимают предварительные договоры купли-продажи, договоры купли-продажи, договоры участия в долевом строительстве, договоры уступки права требования по договорам участия в долевом строительстве и иные договоры, направленные на отчуждение и (или) приобретение объекта недвижимости, предусмотренные законодательством Российской Федерации (далее – Договор реализации).
                                </p>
                                <p>
                                    3.1.5. По запросу Заказчика, консультировать Заказчика относительно порядка, способа и срока оплаты стоимости (цены) объекта недвижимости в соответствии с формами Договоров реализации, используемых правообладателем объекта недвижимости, в т.ч. с использованием кредитных/заемных средств, средств материнского (семейного) капитала, субсидий.
                                </p>
                                <p>
                                    3.1.6. По запросу Заказчика, консультировать его относительно документов, необходимых и достаточных для заключения между Заказчиком и правообладателем объекта недвижимости Договора реализации, а также его государственной регистрации в органе регистрации прав.
                                </p>
                                <p>
                                    3.2. Исполнитель вправе:
                                </p>
                                <p>
                                    3.2.1. Привлекать для исполнения Договора третьих лиц.
                                </p>
                                <p>
                                    3.3. Заказчик обязуется:
                                </p>
                                <p>
                                    3.3.1. Обеспечить Исполнителя необходимой информацией, требующейся для надлежащего выполнения обязательств по Договору, в том числе предоставить копии паспорта, в случае необходимости, документов, подтверждающих семейное положение, и иных документов по требованию Исполнителя.
                                </p>
                                <p>
                                    3.3.2. Своевременно и в полном объеме оплатить услуги Исполнителя.
                                </p>
                                <p>
                                    3.3.3. Уведомлять Исполнителя об изменении своих реквизитов, в том числе адреса регистрации/места жительства, телефона, паспортных данных, адреса электронной почты.
                                </p>
                                <p>
                                    3.3.4. Подавать заявки на одобрение кредита в банки, в которых аккредитован строящийся либо завершенный строительством объект капитального строительства, в котором расположен объект недвижимости, в соответствии со списком, предоставленным Заказчику Исполнителем.
                                </p>
                                <p>
                                    3.3.5. В случае получения отказа кредитного комитета банка в выдаче (одобрении) кредита на приобретение Заказчиком забронированного объекта недвижимости, указанный отказ должен быть предоставлен Заказчиком Исполнителю любым не запрещенным действующим законодательством способом.
                                </p>
                                <p>
                                    &nbsp;
                                </p>
                                <p>
                                    <b>4.</b> <b>Порядок расчетов</b>
                                </p>
                                <p>
                                    4.1.<b> </b>Стоимость услуги Исполнителя, указанной в п. 2.1 Договора, составляет <b><?=$reseveSum?> (<?=$reseveSumText?>) рублей</b>,<b> </b>(НДС не облагается в связи с применением УСН).
                                </p>
                                <p>
                                    Заказчик обязуется произвести оплату услуги в момент заключения настоящего Договора.
                                </p>
                                <p>
                                    4.2.<b> </b>Оплата производится Заказчиком путем перечисления денежных средств на расчетный счет Исполнителя, указанный в п. 1.3. Договора.
                                </p>
                                <p>
                                    4.3. Стороны отдельно определили, что стоимость услуги Исполнителя, указанная в п.4.1 Договора, включает в себя оплату обязательств Исполнителя, поименованных в п. 3.1.1 и п.3.1.2. За исполнение Исполнителем обязанностей, указанных в п.п. 3.1.3 – 3.1.6 Договора, плата не взимается.
                                </p>
                                <p>
                                    4.4. В подтверждение оплаты Заказчиком услуги Исполнителя и заключения настоящего Договора, в течение 1 (одного) рабочего дня с даты полной оплаты стоимости услуги, Исполнитель направляет Заказчику по номеру телефону и/или на адрес электронной почты, указанный (-ые) Заказчиком при бронировании объекта недвижимости на сайте fsknw.ru, отчет о выполнении (оказании) услуги Исполнителя (далее – отчет Исполнителя), с обязательным указанием номера бронирования, даты бронирования, объекта недвижимости, выбранного Заказчиком для бронирования, зафиксированная стоимость объекта недвижимости.
                                </p>
                                <p>
                                    4.5. Стороны признают согласованным, что отчет Исполнителя является надлежащим и достаточным доказательством факта оказания Исполнителем услуги. Составление (подписание) иных документов не требуется.
                                </p>
                                <p>
                                    4.6. Услуга, указанная в п. 2.1 Договора, считается оказанной Исполнителем Заказчику в день направления Заказчику Отчета Исполнителя в порядке, установленном в. 4.4 Договора.
                                </p>
                                <p>
                                    &nbsp;
                                </p>
                                <p>
                                    <b>5. Ответственность Сторон</b>
                                </p>
                                <p>
                                    5.1. За невыполнение или ненадлежащее исполнение условий Договора Стороны несут ответственность в соответствии с действующим законодательством РФ.
                                </p>
                                <p>
                                    5.2.<b> </b>Все споры и разногласия, которые могут возникнуть по Договору, Стороны разрешают путем переговоров и направления претензий, срок ответа на которые составляет 10 (десять) дней с момента получения претензии, а при не достижении согласия в течение 20 (Двадцати) рабочих дней, споры передаются на рассмотрение в суд по месту нахождения Исполнителя.
                                </p>
                                <p>
                                    &nbsp;
                                </p>
                                <p>
                                    <b>6. Срок действия договора</b>
                                </p>
                                <p>
                                    6.1. Настоящий Договор действует до полного исполнения Сторонами принятых на себя обязательств.
                                </p>
                                <p>
                                    <b>&nbsp;</b>
                                </p>
                                <p>
                                    <b>7. Прочие условия</b>
                                </p>
                                <p>
                                    7.1. В случае неподписания /незаключения Заказчиком (либо иным лицом по указанию Заказчика) по основаниям, не связанными с действиями /бездействием Исполнителя, в срок, указанный в п. 2.1 Договора, Договора реализации в отношении объекта недвижимости, выбранного Заказчиком на сайте fsknw.ru и забронированного для него Исполнителем в соответствии с условиями настоящего Договора, денежные средства, оплаченные за фактически оказанные Исполнителем услуги, возврату не подлежат.
                                </p>
                                <p>
                                    7.1.1. В случае получения Заказчиком отказа Банка, выбранного Заказчиком с учетом условий п. 3.3.4. Договора, в получении кредита для приобретения забронированного объекта недвижимости, либо в случае одобрения Банком суммы кредита меньше той суммы, которую Заказчик запрашивал в Банке, Исполнитель осуществляет возврат Заказчику Стоимости услуг в полном объеме. Возврат осуществляется по письменному заявлению Заказчика. Возврат осуществляется в течение 30 (Тридцати) рабочих дней с момента получения от Заказчика соответствующего заявления и предоставления копии документа либо иной информации, свидетельствующих об отказе Заказчику в выдаче кредита Банком на приобретение забронированного объекта недвижимости.
                                </p>
                                <p>
                                    7.1.2. При этом Стороны особо оговорили, что, при наличии одного одобрения из списка банков, в которых аккредитован строящийся либо завершенный строительством объект капитального строительства, в котором расположен забронированный объект недвижимости, на всю запрошенную сумму кредита, и отказа Заказчиком (либо иным лицом по указанию Заказчика) от заключения Договора реализации в отношении забронированного объекта недвижимости, в срок, указанный в п. 2.1. Договора, денежные средства, оплаченные за фактически оказанные Исполнителем услуги, возврату не подлежат.
                                </p>
                                <p>
                                    7.1.3. Пункты 7.1.1 – 7.1.2 Договора применяются при намерении Заказчика приобрести забронированный объект недвижимости с использованием кредитных средств.
                                </p>
                                <p>
                                    7.2. При бронировании Заказчиком 2 (двух) или 3 (трех) комнатной квартиры, Заказчик принимает на себя обязательство по приобретению (покупке) машино-места, расположенного в встроенно-пристроенном подземном гараже по адресу: Санкт-Петербург, муниципальный округ Юнтолово, Парашютная улица, дом 34, строение 1 (далее – подземный гараж), за цену, которая должна быть сообщена Исполнителем Заказчику в течение 2 (двух) рабочих дней после заключения настоящего Договора по номеру телефону и/или на адрес электронной почты, указанный (-ые) Заказчиком при бронировании объекта недвижимости на сайте fsknw.ru.
                                </p>
                                <p>
                                    7.2.1. При несогласии Заказчика с ценой машино-места, сообщенной Исполнителем Заказчику в соответствии с п. 7.2 Договора, настоящий Договор автоматически расторгается в момент получения Исполнителем от Заказчика сообщения/ уведомления об отказе от приобретения машино-места за цену, предложенную Исполнителем.
                                </p>
                                <p>
                                    7.2.1.1. Сообщение/ уведомление об отказе от приобретения машино-места за цену, предложенную Исполнителем, должно быть направлено Заказчиком Исполнителю в течение 2 (двух) рабочих дней с даты сообщения Исполнителем Заказчику цены машино-места в соответствии с п. 7.2 Договора.
                                </p>
                                <p>
                                    7.2.1.2. В случае непоступления Исполнителю от Заказчика сообщения/ уведомления об отказе от приобретения машино-места за цену, предложенную Исполнителем, цена машино-места считается принятой Заказчиком (согласованной Сторонами) и расторжение настоящего Договора по основанию, указанному в п. 7.2.1 Договора, не допускается.
                                </p>
                                <p>
                                    7.2.1.3. При расторжении настоящего Договора в соответствии с п. 7.2.1 Договора, возврат стоимости услуг Исполнителя в размере <?=$reseveSum?> (<?=$reseveSumText?>) рублей осуществляется в течение 30 (тридцати) рабочих дней с даты получения Исполнителем от Заказчика заявления о возврате денежных средств с указанием банковских реквизитов для перечисления.
                                </p>
                                <p>
                                    7.2.2. Заказчик уведомлен Исполнителем, что заключение/ подписание Договора реализации в отношении объекта недвижимости, выбранного Заказчиком на сайте fsknw.ru и забронированного для него Исполнителем в соответствии с условиями настоящего Договора, осуществляется в срок, указанный в п. 2.1 Договора, при условии заключения Заказчиком Договора реализации в отношении машино-место, расположенного в подземном гараже.
                                </p>
                                <p>
                                    7.2.3. В случае незаключения Заказчиком Договора реализации в отношении машино-места, расположенного в подземном гараже, заключение Договора реализации в отношении объекта недвижимости, выбранного Заказчиком на сайте fsknw.ru и забронированного для него Исполнителем, не производится, и денежные средства, оплаченные за фактически оказанные Исполнителем услуги, возврату не подлежат.
                                </p>
                                <p>
                                    7.3. Во всем остальном, что не предусмотрено Договором, Стороны руководствуются действующим законодательством РФ.
                                </p>
                                <p>
                                    7.4. Заказчик настоящим подтверждает, что до заключения (акцептования) он внимательно прочитал настоящий Договор (условия оферты) и полностью уяснил для себя его смысл и значение.
                                </p>
                                <p>
                                    &nbsp;
                                </p>
                                <p>
                                    &nbsp;
                                </p>
                                <table cellspacing="0" cellpadding="0" style="border-collapse: collapse;">
                                    <tbody>
                                    <tr>
                                        <td>
                                            <p>
                                                <b>&nbsp;&nbsp;&nbsp; ИСПОЛНИТЕЛЬ:</b>
                                            </p>
                                            <p>
                                                <b>&nbsp;</b>
                                            </p>
                                            <p>
                                                <b>Общество с ограниченной ответственностью «Агентство недвижимости «ФСК Северо-Запад» (ООО «АН «ФСК Северо-Запад»), </b>адрес: 197198, г. Санкт-Петербург, Большой пр. П.С., д. 48, лит. А, пом. 2-Н, офис 106, ИНН/КПП 7813627626/781301001, ОГРН 1187847371095, р/сч 40702810555000039612, кор/сч 30101810500000000653, Банк: СЕВЕРО-ЗАПАДНЫЙ БАНК ПАО СБЕРБАНК Г. САНКТ-ПЕТЕРБУРГ, БИК 044030653
                                            </p>
                                        </td>
                                    </tr>
                                    </tbody>
                                </table>
                            </div>
                            <?
                        }
                        ?>
                    <?}else{?>
                        <?=$dopText?>
                        <div class="about-bron">
                            <div class="about-bron-text">
                                <p>
                                    <strong class="about-bron-text__title">Основные условия бронирования:</strong>
                                    1. Стоимость бронирования составляет <?=$reseveSum?> руб. Это сумма в дальнейшем включается в стоимость <?=$objectType[$object['PROPERTIES']['category']['VALUE']][1]?>.
                                </p>
                                <p>
                                    2. Бронирование подразумевает фиксацию стоимости на момент оплаты бронирования, а также закрепление данного объекта за вами на срок:<br>
                                    - при 100% оплате 5 дней.<br>
                                    - при ипотеке 14 дней.<br>
                                </p>
                                <p>
                                    3. При оформлении онлайн-бронирования предоставляется скидка в 1% от стоимости, суммируется с прочими скидками и спецпредложениями.
                                </p>
                            </div>
                            <svg class="about-bron__svg" width="108" height="108" viewBox="0 0 108 108" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M86.9062 28.6875C86.9062 29.8518 87.8513 30.7969 89.0156 30.7969C90.1799 30.7969 91.125 29.8518 91.125 28.6875C91.125 27.5232 90.1799 26.5781 89.0156 26.5781C87.8513 26.5781 86.9062 27.5232 86.9062 28.6875Z" fill="#D7D7D7"/>
                                <path d="M95.3431 54.0008C95.3431 56.7027 95.072 59.3995 94.5381 62.0165C94.3049 63.1577 95.0415 64.2717 96.1827 64.5049C96.3253 64.5345 96.467 64.5485 96.6071 64.5485C97.5884 64.5485 98.4676 63.8589 98.672 62.8602C99.2628 59.9656 99.5619 56.9853 99.5619 54.0008C99.5619 47.3588 98.1216 40.9672 95.2797 35.0033C94.7787 33.9519 93.5205 33.5053 92.4683 34.0063C91.416 34.5072 90.9703 35.7663 91.4712 36.8185C94.0404 42.2106 95.3431 47.9916 95.3431 54.0008Z" fill="#D7D7D7"/>
                                <path d="M64.5469 72.9844H62.4375V45.5625C62.4375 44.3974 61.4932 43.4531 60.3281 43.4531H43.4531C42.288 43.4531 41.3438 44.3974 41.3438 45.5625V54C41.3438 55.1651 42.288 56.1094 43.4531 56.1094H45.5625V72.9844H43.4531C42.288 72.9844 41.3438 73.9286 41.3438 75.0938V83.5312C41.3438 84.6964 42.288 85.6406 43.4531 85.6406H64.5469C65.712 85.6406 66.6562 84.6964 66.6562 83.5312V75.0938C66.6562 73.9286 65.712 72.9844 64.5469 72.9844ZM62.4375 81.4219H45.5625V77.2031H47.6719C48.837 77.2031 49.7812 76.2589 49.7812 75.0938V54C49.7812 52.8349 48.837 51.8906 47.6719 51.8906H45.5625V47.6719H58.2188V75.0938C58.2188 76.2589 59.1638 77.2031 60.3281 77.2031H62.4375V81.4219Z" fill="#D7D7D7"/>
                                <path d="M54 39.2344C58.6522 39.2344 62.4375 35.449 62.4375 30.7969C62.4375 26.1447 58.6522 22.3594 54 22.3594C49.3478 22.3594 45.5625 26.1447 45.5625 30.7969C45.5625 35.449 49.3478 39.2344 54 39.2344ZM54 26.5781C56.3261 26.5781 58.2188 28.4708 58.2188 30.7969C58.2188 33.123 56.3261 35.0156 54 35.0156C51.6739 35.0156 49.7812 33.123 49.7812 30.7969C49.7812 28.4708 51.6739 26.5781 54 26.5781Z" fill="#D7D7D7"/>
                                <path d="M54.0001 0C24.8957 0 9.19855e-05 24.8486 9.19855e-05 54C9.19855e-05 63.9577 2.85352 74.5475 7.6647 82.5573L0.108033 105.224C-0.144104 105.981 0.0528264 106.818 0.618073 107.382C1.18579 107.95 2.02295 108.143 2.77689 107.891L25.4436 100.335C33.4526 105.147 44.0424 108 54.0001 108C83.1119 108 108 83.1481 108 54C108 24.8882 83.149 0 54.0001 0V0ZM54.0001 103.781C44.4478 103.781 34.2947 100.962 26.8402 96.2411C26.3121 95.9065 25.6537 95.8184 25.044 96.0219L5.44492 102.555L11.9782 82.9561C12.1793 82.3546 12.0985 81.6954 11.759 81.1599C7.03766 73.7062 4.21884 63.5523 4.21884 54C4.21884 27.0157 27.0157 4.21875 54.0001 4.21875C80.9844 4.21875 103.781 27.0157 103.781 54C103.781 80.9843 80.9844 103.781 54.0001 103.781Z" fill="#D7D7D7"/>
                            </svg>
                        </div>
                        <h2 class="h1 title">Договор оферта</h2>
                        <div>
                            <p>
                                <b>1. Общие положения</b>
                            </p>
                            <p>
                                1.1. Настоящий Договор-оферта (далее – Договор) является официальным предложением (публичной офертой)<b> Общества с ограниченной ответственностью «Агентство недвижимости «ФСК Северо-Запад» (ООО «АН «ФСК Северо-Запад»)</b>, ОГРН: 1187847371095, ИНН/КПП 7813627626/781301001, зарегистрировано Межрайонной инспекцией Федеральной налоговой службы №15 по Санкт-Петербургу 10.12.2018, адрес: 197198, г. Санкт-Петербург, Большой пр. П.С., д. 48, лит. А, пом. 2-Н, офис 106, в лице генерального директора Межевской Анастасии Ивановны, действующей на основании Устава, именуемое в дальнейшем «Исполнитель», <i>для полностью дееспособных физических лиц и юридических лиц</i>, которые примут настоящее предложение на указанных ниже условиях.
                            </p>
                            <p>
                                1.2. В соответствии с пунктом 2 статьи 437 Гражданского кодекса Российской Федерации (далее – ГК РФ) в случае принятия изложенных ниже условий и оплаты услуг Исполнителя, физическое или юридическое лицо, производящее акцепт этой оферты, становится Заказчиком (в соответствии с пунктом 3 статьи 438 ГК РФ акцепт оферты равносилен заключению договора на условиях, изложенных в оферте).
                            </p>
                            <p>
                                1.3. Моментом полного и безоговорочного принятия Заказчиком предложения Исполнителя заключить Договор-оферты (акцептом оферты) считается факт оплаты услуг Исполнителя в размере <b><?=$reseveSum?> (<?=$reseveSumText?>) рублей</b>, посредством перечисления денежных средств на расчетный счет Исполнителя по следующим реквизитам: <b>р/сч. 40702810555000039612, кор/сч. 30101810500000000653, Банк: СЕВЕРО-ЗАПАДНЫЙ БАНК ПАО СБЕРБАНК Г. САНКТ ПЕТЕРБУРГ, БИК 044030653</b>.
                            </p>
                            <p>
                                1.4. Осуществляя акцепт оферты по Договору в порядке, определенном в п. 1.3 Договора (оплачивая услуги Исполнителя), Заказчик подтверждает, что он ознакомлен и ему понятны условия Договора, полностью и безоговорочно принимает все условия Договора в том виде, в каком они изложены в тексте Договора.
                            </p>
                            <p>
                                1.5. Заказчик согласен, что акцепт Договора в порядке, определенном в п. 1.3 Договора, является заключением Договора на условиях, изложенных ниже.
                            </p>
                            <p>
                                1.6. Договор не требует скрепления печатями и/или подписания Заказчиком и Исполнителем (далее по тексту – Стороны) и имеет юридическую силу.
                            </p>
                            <p>
                                1.7. Для целей настоящего Договора под объектом недвижимости понимается квартира, нежилое помещение, машино-место, права требования объекта долевого строительства и др., размещенные на сайте fsknw.ru и доступные для бронирования.
                            </p>
                            <p>
                                <b>&nbsp;</b>
                            </p>
                            <p>
                                <b>2. Предмет договора</b>
                            </p>
                            <p>
                                2.1. В соответствии с настоящим Договором Исполнитель обязуется оказать Заказчику на возмездной основе услуги по бронированию за Заказчиком выбранного им объекта недвижимости сроком на:<br>
                                - 5 (пять) рабочих дней – при намерении Заказчика приобрести объект недвижимости без использования кредитных денежных средств (за счет собственных средств);<br>
                                - 14 (четырнадцать) рабочих дней – при намерении Заказчика приобрести объект недвижимости с использованием кредитных денежных средств.<br>
                            </p>
                            <p>
                                2.1.1. На весь период бронирования фиксируется стоимость (цена) объекта недвижимости, выбранного Заказчиком на сайте fsknw.ru.
                            </p>
                            <p>
                                &nbsp;
                            </p>
                            <p>
                                <b>3. Права и обязанности Сторон</b>
                            </p>
                            <p>
                                3.1. Исполнитель обязуется:
                            </p>
                            <p>
                                3.1.1. Забронировать за Заказчиком на срок, указанный в п. 2.1 Договора, выбранный им на сайте fsknw.ru объект недвижимости.
                            </p>
                            <p>
                                3.1.2. В одностороннем порядке не изменять стоимость (цену) объекта недвижимости, забронированного Заказчиком на сайте fsknw.ru.
                            </p>
                            <p>
                                3.1.3. По запросу Заказчика, консультировать его относительно объекта недвижимости, забронированного Заказчиком на сайте fsknw.ru.
                            </p>
                            <p>
                                3.1.4. По запросу Заказчика, разъяснить Заказчику положения гражданско-правовых договоров, по которым правообладатель объекта недвижимости заключает сделки по его отчуждению. Под гражданско-правовыми договорами Стороны понимают предварительные договоры купли-продажи, договоры купли-продажи, договоры участия в долевом строительстве, договоры уступки права требования по договорам участия в долевом строительстве и иные договоры, направленные на отчуждение и (или) приобретение объекта недвижимости, предусмотренные законодательством Российской Федерации (далее – Договор реализации).
                            </p>
                            <p>
                                3.1.5. По запросу Заказчика, консультировать Заказчика относительно порядка, способа и срока оплаты стоимости (цены) объекта недвижимости в соответствии с формами Договоров реализации, используемых правообладателем объекта недвижимости, в т.ч. с использованием кредитных/заемных средств, средств материнского (семейного) капитала, субсидий.
                            </p>
                            <p>
                                3.1.6. По запросу Заказчика, консультировать его относительно документов, необходимых и достаточных для заключения между Заказчиком и правообладателем объекта недвижимости Договора реализации, а также его государственной регистрации в органе регистрации прав.
                            </p>
                            <p>
                                3.2. Исполнитель вправе:
                            </p>
                            <p>
                                3.2.1. Привлекать для исполнения Договора третьих лиц.
                            </p>
                            <p>
                                3.3. Заказчик обязуется:
                            </p>
                            <p>
                                3.3.1. Обеспечить Исполнителя необходимой информацией, требующейся для надлежащего выполнения обязательств по Договору, в том числе предоставить копии паспорта, в случае необходимости, документов, подтверждающих семейное положение, и иных документов по требованию Исполнителя.
                            </p>
                            <p>
                                3.3.2. Своевременно и в полном объеме оплатить услуги Исполнителя.
                            </p>
                            <p>
                                3.3.3. Уведомлять Исполнителя об изменении своих реквизитов, в том числе адреса регистрации/места жительства, телефона, паспортных данных, адреса электронной почты.
                            </p>
                            <p>
                                3.3.4. Подавать заявки на одобрение кредита в банки, в которых аккредитован строящийся либо завершенный строительством объект капитального строительства, в котором расположен объект недвижимости, в соответствии со списком, предоставленным Заказчику Исполнителем.
                            </p>
                            <p>
                                3.3.5. В случае получения отказа кредитного комитета банка в выдаче (одобрении) кредита на приобретение Заказчиком забронированного объекта недвижимости, указанный отказ должен быть предоставлен Заказчиком Исполнителю любым не запрещенным действующим законодательством способом.
                            </p>
                            <p>
                                &nbsp;
                            </p>
                            <p>
                                <b>4.</b> <b>Порядок расчетов</b>
                            </p>
                            <p>
                                4.1.<b> </b>Стоимость услуги Исполнителя, указанной в п. 2.1 Договора, составляет <b><?=$reseveSum?> (<?=$reseveSumText?>) рублей</b>,<b> </b>(НДС не облагается в связи с применением УСН).
                            </p>
                            <p>
                                Заказчик обязуется произвести оплату услуги в момент заключения настоящего Договора.
                            </p>
                            <p>
                                4.2.<b> </b>Оплата производится Заказчиком путем перечисления денежных средств на расчетный счет Исполнителя, указанный в п. 1.3. Договора.
                            </p>
                            <p>
                                4.3. Стороны отдельно определили, что стоимость услуги Исполнителя, указанная в п.4.1 Договора, включает в себя оплату обязательств Исполнителя, поименованных в п. 3.1.1 и п.3.1.2. За исполнение Исполнителем обязанностей, указанных в п.п. 3.1.3 – 3.1.6 Договора, плата не взимается.
                            </p>
                            <p>
                                4.4. В подтверждение оплаты Заказчиком услуги Исполнителя и заключения настоящего Договора, в течение 1 (одного) рабочего дня с даты полной оплаты стоимости услуги, Исполнитель направляет Заказчику по номеру телефону и/или на адрес электронной почты, указанный (-ые) Заказчиком при бронировании объекта недвижимости на сайте fsknw.ru, отчет о выполнении (оказании) услуги Исполнителя (далее – отчет Исполнителя), с обязательным указанием номера бронирования, даты бронирования, объекта недвижимости, выбранного Заказчиком для бронирования, зафиксированная стоимость объекта недвижимости.
                            </p>
                            <p>
                                4.5. Стороны признают согласованным, что отчет Исполнителя является надлежащим и достаточным доказательством факта оказания Исполнителем услуги. Составление (подписание) иных документов не требуется.
                            </p>
                            <p>
                                4.6. Услуга, указанная в п. 2.1 Договора, считается оказанной Исполнителем Заказчику в день направления Заказчику Отчета Исполнителя в порядке, установленном в. 4.4 Договора.
                            </p>
                            <p>
                                &nbsp;
                            </p>
                            <p>
                                <b>5. Ответственность Сторон</b>
                            </p>
                            <p>
                                5.1. За невыполнение или ненадлежащее исполнение условий Договора Стороны несут ответственность в соответствии с действующим законодательством РФ.
                            </p>
                            <p>
                                5.2.<b> </b>Все споры и разногласия, которые могут возникнуть по Договору, Стороны разрешают путем переговоров и направления претензий, срок ответа на которые составляет 10 (десять) дней с момента получения претензии, а при не достижении согласия в течение 20 (Двадцати) рабочих дней, споры передаются на рассмотрение в суд по месту нахождения Исполнителя.
                            </p>
                            <p>
                                &nbsp;
                            </p>
                            <p>
                                <b>6. Срок действия договора</b>
                            </p>
                            <p>
                                6.1. Настоящий Договор действует до полного исполнения Сторонами принятых на себя обязательств.
                            </p>
                            <p>
                                <b>&nbsp;</b>
                            </p>
                            <p>
                                <b>7. Прочие условия</b>
                            </p>

                            <p>
                                7.1. В случае неподписания /незаключения Заказчиком (либо иным лицом по указанию Заказчика) по основаниям, не связанными с действиями /бездействием Исполнителя, в срок, указанный в п. 2.1 Договора, Договора реализации в отношении объекта недвижимости, выбранного Заказчиком на сайте fsknw.ru и забронированного для него Исполнителем в соответствии с условиями настоящего Договора, денежные средства, оплаченные за фактически оказанные Исполнителем услуги, возврату не подлежат.
                            </p>
                            <p>
                                7.1.1. В случае получения Заказчиком отказа Банка, выбранного Заказчиком с учетом условий п. 3.3.4. Договора, в получении кредита для приобретения забронированного объекта недвижимости, либо в случае одобрения Банком суммы кредита меньше той суммы, которую Заказчик запрашивал в Банке, Исполнитель осуществляет возврат Заказчику Стоимости услуг в полном объеме. Возврат осуществляется по письменному заявлению Заказчика. Возврат осуществляется в течение 30 (Тридцати) рабочих дней с момента получения от Заказчика соответствующего заявления и предоставления копии документа либо иной информации, свидетельствующих об отказе Заказчику в выдаче кредита Банком на приобретение забронированного объекта недвижимости.
                            </p>
                            <p>
                                7.1.2. При этом Стороны особо оговорили, что, при наличии одного одобрения из списка банков, в которых аккредитован строящийся либо завершенный строительством объект капитального строительства, в котором расположен забронированный объект недвижимости, на всю запрошенную сумму кредита, и отказа Заказчиком (либо иным лицом по указанию Заказчика) от заключения Договора реализации в отношении забронированного объекта недвижимости, в срок, указанный в п. 2.1. Договора, денежные средства, оплаченные за фактически оказанные Исполнителем услуги, возврату не подлежат.
                            </p>
                            <p>
                                7.1.3. Пункты 7.1.1 – 7.1.2 Договора применяются при намерении Заказчика приобрести забронированный объект недвижимости с использованием кредитных средств.
                            </p>
                            <p>
                                7.2. Во всем остальном, что не предусмотрено Договором, Стороны руководствуются действующим законодательством РФ.
                            </p>
                            <p>
                                7.3 Заказчик настоящим подтверждает, что до заключения (акцептования) он внимательно прочитал настоящий Договор (условия оферты) и полностью уяснил для себя его смысл и значение.
                            </p>

                            <table cellspacing="0" cellpadding="0" style="border-collapse: collapse;">
                                <tbody>
                                <tr>
                                    <td>
                                        <p>
                                            <b>&nbsp;&nbsp;&nbsp; ИСПОЛНИТЕЛЬ:</b>
                                        </p>
                                        <p>
                                            <b>Общество с ограниченной ответственностью «Агентство недвижимости «ФСК Северо-Запад» (ООО «АН «ФСК Северо-Запад»), </b>адрес: 197198, г. Санкт-Петербург, Большой пр. П.С., д. 48, лит. А, пом. 2-Н, офис 106, ИНН/КПП 7813627626/781301001, ОГРН 1187847371095, р/сч 40702810555000039612, кор/сч 30101810500000000653, Банк: СЕВЕРО-ЗАПАДНЫЙ БАНК ПАО СБЕРБАНК Г. САНКТ-ПЕТЕРБУРГ, БИК 044030653
                                        </p>
                                    </td>
                                </tr>
                                </tbody>
                            </table>
                        </div>
                    <?}?>

                    <?/*
                        <?global $USER;
                        if($USER->IsAdmin()){?>
                        <pre><?print_r($object['PROPERTIES']['rooms'])?></pre>
                            <pre><?print_r($object['PROPERTIES'])?></pre>
                        <?}else{?>

                        <?}?>
    */?>
                    <div class="reservation-oferta-next">
                        <div class="btn btn--bg reservation-oferta-next__btn" data-btn="confirm">
                            <svg width="22" height="20" viewBox="0 0 22 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M21.7511 0.801702C21.4191 0.430683 20.881 0.430683 20.549 0.801702L10.3654 12.1834L6.45106 7.80851C6.11913 7.43749 5.58097 7.43753 5.24897 7.80851C4.91701 8.17949 4.91701 8.78096 5.24897 9.15198L9.7644 14.1986C10.0962 14.5695 10.6348 14.5693 10.9665 14.1986L21.7511 2.14521C22.083 1.77423 22.083 1.17272 21.7511 0.801702Z" fill="#FFFEFE"/>
                                <path d="M10 1.5C5.31308 1.5 1.5 5.31308 1.5 10C1.5 14.6869 5.31308 18.5 10 18.5C14.6869 18.5 18.5 14.6869 18.5 10C18.5 5.31308 14.6869 1.5 10 1.5ZM10 0C15.5229 0 20 4.47715 20 10C20 15.5229 15.5229 20 10 20C4.47715 20 0 15.5229 0 10C0 4.47715 4.47715 0 10 0Z" fill="white"/>
                            </svg>
                            Принимаю условия
                        </div>
                    </div>
                <?}?>
            </div>
        <form id="card" data-type="content" style="display:none;" class="reservation-card" >
                <div class="anketa-content-block section-margin">
                    <h2 class="h1 title">Основные данные</h2>
                    <div class="anketa-content-block-row">
                        <div class="anketa-content-block-row-input">
                            <label class="general-itemInput__label_top">Фамилия</label>
                            <input placeholder="Иванов" id="last_name" name="last_name" type="text" data-required="" required>
                        </div>
                        <div class="anketa-content-block-row-input">
                            <label class="general-itemInput__label_top">Имя</label>
                            <input placeholder="Иван" id="first_name" name="first_name" type="text" data-required="" required>
                        </div>
                        <div class="anketa-content-block-row-checkbox">
                            <label for="">Способ оплаты</label>
                            <div class="anketa-content-block-row-checkbox-row">
                                <label class="anketa-content-block-row-checkbox-row-input">
                                    <input type="radio" name="payType" checked="checked" value="mortgage">
                                    <span></span>
                                    <span>Ипотека</span>
                                </label>
                                <label class="anketa-content-block-row-checkbox-row-input">
                                    <input type="radio" name="payType" value="full">
                                    <span></span>
                                    <span>100% оплата</span>
                                </label>
                            </div>
                        </div>
                    </div>
                    <div class="anketa-content-block-row">
                        <div class="anketa-content-block-row-input">
                            <label class="general-itemInput__label_top">E-mail</label>
                            <input placeholder="username@mail.ru" id="email" name="email" data-type="email " data-required="" required>
                        </div>
                        <div class="anketa-content-block-row-input">
                            <label class="general-itemInput__label_top">Телефон</label>
                            <input placeholder="+7 (999) 123-45-67" id="tel" name="tel" data-required="" type="text" required>
                            <span class="confimButtom none" data-send-sms-order>
                                    Выслать код
                                    <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <circle cx="7" cy="7" r="7" fill="#FFCA0F"/>
                                        <path d="M6 5L8 7L6 9" stroke="black" stroke-linecap="round" stroke-linejoin="round"/>
                                    </svg>
                                </span>
                        </div>
                        <div class="anketa-content-block-row-input">
                            <label class="general-itemInput__label_top">Код подтверждения телефона</label>
                            <input placeholder="ХХХХ" id="sms" disabled="disabled" name="sms" data-required="" type="text" required>
                            <div class="confirm-code-repeat confimButtom none" data-send-sms-order>
                                <svg width="25" height="25" viewBox="0 0 25 25" fill="none" xmlns="http://www.w3.org/2000/svg"><circle cx="12.5" cy="12.5" r="12.5" fill="#E94200"></circle><g clip-path="url(#clip0)"><path d="M12.9165 6.70924V4.1665L9.28398 7.79898L12.9165 11.4315V8.16223C15.3139 8.16223 17.2754 10.1238 17.2754 12.5212C17.2754 14.9186 15.3139 16.8802 12.9165 16.8802C10.519 16.8802 8.55748 14.9186 8.55748 12.5212H7.10449C7.10449 15.7178 9.71988 18.3332 12.9165 18.3332C16.113 18.3332 18.7284 15.7178 18.7284 12.5212C18.7284 9.32462 16.113 6.70924 12.9165 6.70924Z" fill="white"></path></g><defs><clipPath id="clip0"><rect width="14.1667" height="14.1667" fill="white" transform="translate(5.8335 4.1665)"></rect></clipPath></defs></svg>
                            </div>
                        </div>
                    </div>
                </div>
                <style>
                    .reservation-card-bot__btn.disabled {
                        background: #bababa;
                        border: 1px #bababa;
                    }
                    .confimButtom {
                        position: absolute;
                        right: 10px;
                        top: 56%;
                        font-size: 14px;
                        color: blue;
                        cursor: pointer;
                        display: -webkit-flex;
                        display: -moz-flex;
                        display: -ms-flex;
                        display: -o-flex;
                        display: flex;
                        -ms-align-items: center;
                        align-items: center;
                        color: #727272;
                    }
                    .confimButtom svg{
                        margin-left: 8px;
                    }
                </style>
                <script>
                    document.addEventListener("DOMContentLoaded", function (event) {
                        currentPayType();
                    });

                    function currentPayType(){
                        let type = document.querySelector(`input[name="payType"]:checked`);
                        let notice =document.querySelector(`[data-target="mortgageNotice"]`);
                        if (type){
                            if (type.value==='mortgage'){
                                notice.style.display = 'block';
                            }else{
                                notice.style.display = 'none';
                            }
                        }
                    }
                    const userData = <?=json_encode([ "first_name" => $name, "last_name" => $lastName, "email" => $email, "tel" => $phone])?>;
                    const inputSelector = '#card input:not([name="sms"])';

                    function closeConfirmCodeRepeat() {
                        let confirmCodeRepeat = document.querySelectorAll('.confirm-code-repeat');
                        confirmCodeRepeat[0].classList.add('none');
                        setTimeout(() => {
                            confirmCodeRepeat[0].classList.remove('none');
                        }, 60000);
                    }

                    let payBtm = document.querySelector('[data-type="pay"]');

                    Helper.addEvent(document, 'click', '[data-btn="confirm"]', (e) => {
                        payBtm = document.querySelector('[data-type="pay"]');
                        payBtm.removeAttribute('data-type');
                        payBtm.classList.add('disabled');
                        let phones = document.querySelectorAll('[name="tel"]');
                        let smss = document.querySelectorAll('[name="sms"]');
                        let lastName = document.querySelectorAll('[name="last_name"]');
                        let firstName = document.querySelectorAll('[name="first_name"]');

                        let input = document.querySelectorAll('input');

                        input.forEach( element => {
                            let name = element.getAttribute('name');
                            if(userData[name]) {
                                element.value = userData[name];
                                element.classList.add('input-border');
                            }
                        });

                        phones.forEach( element => Helper.initMask(element, { mask: '+{7} (000) 000-00-00' }));
                        lastName.forEach( element => Helper.initMask(element, { mask: /^[А-ЯЁ]*[а-яё]*$/ }));
                        firstName.forEach( element => Helper.initMask(element, { mask: /^[А-ЯЁ]*[а-яё]*$/ }));
                        smss.forEach( element => Helper.initMask(element, { mask: '0000' }));

                        checkFieldValidation(inputSelector);

                    });


                    Helper.addEvent(document, 'click', '[data-send-sms-order]', (e) => {
                        let form = document.querySelector('#card');
                        let input = form.querySelectorAll('input');
                        let formData = {};
                        let formDataS = new FormData();
                        input.forEach(element => {
                            let name = element.getAttribute('name');
                            formData[name] = element.value;
                            formDataS.append(name, element.value);
                        });
                        if(formData['tel']) {
                            QuerySend.querySendPost(formDataS, (response) => {
                                if (response.isSuccess == true) {
                                    let phones = document.querySelectorAll('[name="tel"]');
                                    phones.forEach(element => {
                                        let top = $(element).parents('.anketa-content-block-row-input').find('.confimButtom').eq(0);
                                        top.addClass('none');
                                        closeConfirmCodeRepeat();
                                    });
                                } else alert(response.message);
                            }, '/ajax/?act=User.SendSMSOrderConfirm');
                        } else {
                            alert('Не введен телефон');
                        }
                    });

                    const checkFieldValidation = (inputSelector) => {
                        let dataForm = {};
                        let inputs = document.querySelectorAll(inputSelector);
                        inputs.forEach((input) => {
                            let name = input.getAttribute('name');
                            let type = input.getAttribute('type');
                            if(type === 'radio') {
                                if(input.checked) {
                                    dataForm[name] = input.value;
                                }
                            } else {
                                dataForm[name] = input.value;
                            }
                        });
                        let smsField = document.querySelectorAll('[name="sms"]');
                        let phones = document.querySelectorAll('[name="tel"]');
                        let tel = dataForm['tel'].replace(/[^\d;]/g, '');
                        console.log(tel,tel.length)
                        if(dataForm['last_name'].length > 1 && dataForm['first_name'].length > 1 && tel.length === 11) {
                            smsField.forEach(element => {
                                element.removeAttribute('disabled')
                            });
                            phones.forEach(element => {
                                let top = $(element).parents('.anketa-content-block-row-input').find('.confimButtom').eq(0);
                                top.removeClass('none');
                            });
                        } else {
                            smsField.forEach(element => {
                                element.setAttribute('disabled','disabled');
                                element.value = "";
                            });
                            phones.forEach(element => {
                                let top = $(element).parents('.anketa-content-block-row-input').find('.confimButtom').eq(0);
                                top.addClass('none');
                            });
                        }
                        let allFieldIn = true;
                        for(let fieldKey in dataForm) {
                            if(fieldKey === 'basket' || fieldKey === 'iblock') continue;
                            let field = dataForm[fieldKey];
                            if(field.length < 2) allFieldIn = false;
                        }
                        if(allFieldIn) {
                            payBtm.setAttribute('data-type', 'pay');
                            payBtm.classList.remove('disabled');
                        } else {
                            if (payBtm){
                                payBtm.removeAttribute('data-type');
                                payBtm.classList.add('disabled');
                            }
                        }
                    };

                    Helper.addEvent(document, 'input', inputSelector, (e) => {
                        console.log('input');
                        currentPayType();
                        checkFieldValidation(inputSelector);
                    });
                </script>
                <?/*
                    <!--h2 class="h1 title">Информация для брони</h2>
                    <div class="reservation-card-form">
                        <div class="reservation-card__title">Данные покупателя</div>

                        <div class="reservation-card-form-content" style="padding-bottom: 0px;">
                            <div class="reservation-card-form-content-col">
                                <span>Имя</span>
                                <input type="text" name="first_name" data-required=""  value="<?//=$name?>">
                            </div>
                            <div class="reservation-card-form-content-col">
                                <span>Фамилия</span>
                                <input type="text" name="last_name" data-required="" value="<?//=$lastName?>">
                            </div>
                            <div class="reservation-card-form-content-col">
                                <span>Способ оплаты:</span>
                                <input type="text" name="last_name" data-required="" value="<?//=$lastName?>">
                            </div>
                        </div>
                        <div class="reservation-card-form-content">
                            <div class="reservation-card-form-content-col">
                                <span>Телефон</span>
                                <input type="text" name="tel" data-type="tel" data-required="" value="<?//=$phone?>">
                            </div>
                            <div class="reservation-card-form-content-col">
                                <span>Код подтверждения телефона</span>
                                <input type="text" name="first_name" data-required=""  value="<?//=$name?>">
                            </div>
                            <div class="reservation-card-form-content-col">
                                <span>E-mail:</span>
                                <input type="text" name="email" data-type="email " data-required="" value="<?//=$email?>">
                            </div>


                        </div>
                    </div-->
                    */?>
                <p>Все поля в данной форме являются обязательными к заполнению.</p>
                <?if (isset($object) && !empty($object)){?>
                    <div class="reservation-card-main">
                        <div class="reservation-card__title">Информация об объекте</div>
                        <div class="reservation-card-main-content">
                            <div class="reservation-card-main-content__img">
                                <input type="hidden" name="product" value="<?=$object['ID']?>">
                                <input type="hidden" name="basket" value="">
                                <input type="hidden" name="iblock" value="<?=$object['IBLOCK_ID']?>">
                                <?if (empty($image)){?>
                                    <div class="img img-empty"></div>
                                <?}
                                else{?>
                                    <img alt="plan" src="<?=$image?>">
                                <?}?>
                            </div>
                            <div class="reservation-card-main-content-info">
                                <div class="reservation-card-main-content-info__name"><?=$object['PROPERTIES']['apartments']['VALUE'] == "true" ? "Лот ".$object['PROPERTIES']['area']['VALUE']." м2" : $object['NAME']." м2"?> </div>
                                <div class="reservation-card-main-content-info-row">
                                    <span>Общая площадь</span>
                                    <span><?=$object['PROPERTIES']['area']['VALUE']?> м2</span>
                                </div>
                                <div class="reservation-card-main-content-info-row">
                                    <span>Жилая площадь</span>
                                    <span><?=$object['PROPERTIES']['livingspace']['VALUE']?> м2</span>
                                </div>
                                <div class="reservation-card-main-content-info-row">
                                    <span>Этаж / этажей</span>
                                    <span><?=$object['PROPERTIES']['floor']['VALUE']?> / <?=$object['PROPERTIES']['floorstotal']['VALUE']?></span>
                                </div>
                                <div class="reservation-card-main-content-info-row">
                                    <span>Отделка</span>
                                    <span><?=$object['PROPERTIES']['renovation']['VALUE']?></span>
                                </div>
                                <div class="reservation-card-main-content-info-row reservation__price">
                                    <span>Стоимость при 100% оплате/ипотеке</span>
                                    <span><?=CurrencyFormat($price, 'RUB');?> </span>
                                </div>
                                <?/*
                                    <!--div-- class="reservation-card-main-content-info-row reservation__price">
                                        <span>Стоимость при резерве</span>
                                        <input type="hidden" name="price" value="10000">
                                        <span>10 000 р.</span>
                                    </!--div-->
                                    */?>
                                <div class="reservation-card-main-content-info__id">ID объекта: <?=CurrencyFormat($object['CODE'], 'NUN');?></div>
                              <div data-target="mortgageNotice" style=" display: none ">
                                <?if (!empty($object['PROPERTIES']['priceGrant100exceptions']['VALUE'])){
                                  $mortgageInfo = json_decode($object['PROPERTIES']['priceGrant100exceptions']['~VALUE'],true);
                                  foreach ($mortgageInfo as $mortgage){
                                  ?>
                                    <div class="reservation-card-main-content-info__id">
                                      При выборе кредитного продукта <?=$mortgage['bank']?> с субсидированными ставками применяется сниженная скидка на
                                      объект в размере <?=$mortgage['percent']?>%, стоимость
                                      составляет&nbsp;<?= CurrencyFormat($mortgage['value'], 'RUB'); ?>
                                    </div>
                                  <?}
                                  ?>
                                <?}?>
                              </div>
                            </div>
                        </div>
                    </div>
                <?}?>
                <div class="reservation-card-bot">
                    <span>Отправляя форму, вы подтверждаете своё согласие на <a href="https://fsknw.ru/privacy-policy/" target="_blank">обработку персональных данных</a>, условия <a href="https://fsknw.ru/user-agreement/" target="_blank">пользовательского соглашения</a>, договора оферты, а также <a href="https://fsknw.ru/payment-policies-on-the-website/" target="_blank">правил использования кредитных карт. </a></span>
                    <div class="btn btn--bg reservation-card-bot__btn" data-type="pay">
                        <svg width="22" height="20" viewBox="0 0 22 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M21.7511 0.801702C21.4191 0.430683 20.881 0.430683 20.549 0.801702L10.3654 12.1834L6.45106 7.80851C6.11913 7.43749 5.58097 7.43753 5.24897 7.80851C4.91701 8.17949 4.91701 8.78096 5.24897 9.15198L9.7644 14.1986C10.0962 14.5695 10.6348 14.5693 10.9665 14.1986L21.7511 2.14521C22.083 1.77423 22.083 1.17272 21.7511 0.801702Z" fill="#FFFEFE"/>
                            <path d="M10 1.5C5.31308 1.5 1.5 5.31308 1.5 10C1.5 14.6869 5.31308 18.5 10 18.5C14.6869 18.5 18.5 14.6869 18.5 10C18.5 5.31308 14.6869 1.5 10 1.5ZM10 0C15.5229 0 20 4.47715 20 10C20 15.5229 15.5229 20 10 20C4.47715 20 0 15.5229 0 10C0 4.47715 4.47715 0 10 0Z" fill="white"/>
                        </svg>
                        Перейти к оплате
                    </div>
                </div>
            </form>
        <div id="error" data-type="content" <?=($error && !$successful)?'style="display:block;"':'style="display:none;"'?> class="reservation-message" >
            <div class="reservation-message-error reservation-message-block">
                <?if($typeError === 2):?>
                    <div class="reservation-message-col">
                        <p style="text-align: center">
                            Данная квартира находится в предварительном резерве.<br>
                            Пожалуйста, свяжитесь с менеджером по тел. <a href="tel:88127035555">+7 (812) 703-55-55</a> для уточнения информации.
                        </p>
                    </div>
                <?else:?>
                    <div class="reservation-message-col">
                        <p>Что-то пошло не так!</br></br>Свяжитесь с нашим специалистом для решения вопроса, либо попробуйте забронировать ещё раз.</p>
                        <a class="btn btn--transp reservation-message__btn" href="/newbuild/komendantskiy/">
                            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 20 20" class="svg btn__ic ic-arrow inlined-svg lazyloaded" data-src="/local/templates/fsk/img/icons/ic-arrow.svg" width="20" height="20" role="img" aria-labelledby="title"><title>link</title><g transform="translate(0 20) rotate(-90)"><g transform="translate(20) rotate(90)" fill="none"><path d="M10,0A10,10,0,1,1,0,10,10,10,0,0,1,10,0Z" stroke="none"></path><path d="M 10.00000095367432 1.500001907348633 C 5.313080787658691 1.500001907348633 1.500001907348633 5.313080787658691 1.500001907348633 10.00000095367432 C 1.500001907348633 14.68692111968994 5.313080787658691 18.5 10.00000095367432 18.5 C 14.68692111968994 18.5 18.5 14.68692111968994 18.5 10.00000095367432 C 18.5 5.313080787658691 14.68692111968994 1.500001907348633 10.00000095367432 1.500001907348633 M 10.00000095367432 1.9073486328125e-06 C 15.52285099029541 1.9073486328125e-06 20 4.477150917053223 20 10.00000095367432 C 20 15.52285099029541 15.52285099029541 20 10.00000095367432 20 C 4.477150917053223 20 1.9073486328125e-06 15.52285099029541 1.9073486328125e-06 10.00000095367432 C 1.9073486328125e-06 4.477150917053223 4.477150917053223 1.9073486328125e-06 10.00000095367432 1.9073486328125e-06 Z" stroke="none"></path></g><g transform="translate(7.236 5.719)"><g transform="translate(5.504 5.4) rotate(90)"><g transform="translate(0 5.504) rotate(-90)"><path d="M0,0,2.752,2.752,5.5,0" fill="none" stroke-linecap="round" stroke-linejoin="round" stroke-miterlimit="10" stroke-width="1.5"></path></g></g><line y2="7.826" transform="translate(2.739)" fill="none" stroke-linecap="round" stroke-width="1.5"></line></g></g></svg>
                            Забронировать снова
                        </a>
                    </div>
                <?endif?>
                <div class="reservation-message-img">
                    <div class="reservation-message-img__back"></div>
                    <div class="reservation-message-img__text">
                        <svg width="62" height="62" viewBox="0 0 62 62" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <circle cx="31" cy="31" r="29" stroke="white" stroke-width="4"/>
                            <path d="M43 41.9988L21.0012 20" stroke="white" stroke-width="4" stroke-linecap="round"/>
                            <path d="M21 41.9988L42.9988 20" stroke="white" stroke-width="4" stroke-linecap="round"/>
                        </svg>
                        Ошибка</br>бронирования!
                    </div>
                </div>
            </div>
        </div>
        <div id="success" <?=$successful?'style="display:block;"':'style="display:none;"'?> data-type="content" class="reservation-message">
            <div class="reservation-message-success reservation-message-block">
                <div class="reservation-message-img">
                    <div class="reservation-message-img__back"></div>
                    <div class="reservation-message-img__text">
                        <svg width="58" height="57" viewBox="0 0 58 57" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M29.0016 55.4123C44.1342 55.4123 56.4016 43.3639 56.4016 28.5015C56.4016 13.6392 44.1342 1.59082 29.0016 1.59082C13.869 1.59082 1.60156 13.6392 1.60156 28.5015C1.60156 43.3639 13.869 55.4123 29.0016 55.4123Z" stroke="white" stroke-width="2"/>
                            <path d="M41.6916 19.3291C41.2804 18.8903 40.6137 18.8903 40.2025 19.3291L24.6466 36.2879L19.7975 31.1141C19.3863 30.6753 18.7197 30.6753 18.3084 31.1141C17.8972 31.5528 17.8972 32.2641 18.3084 32.7029L23.902 38.6711C24.3131 39.1098 24.9802 39.1095 25.3911 38.6711L41.6916 20.9179C42.1028 20.4792 42.1028 19.7679 41.6916 19.3291Z" fill="white" stroke="white" stroke-width="0.5"/>
                        </svg>
                        Бронирование прошло успешно!
                    </div>
                </div>
                <div class="reservation-message-col">
                    <p>Благодарим вас! Теперь объект и стоимость зафиксированы за вами. Наш специалист свяжется с вами в ближайшее время для обсуждения дальнейших этапов.</p>
                    <p>Мы создали для вас личный кабинет, где вы можете отслеживать статус своего бронирования, а также осуществить онлайн-оформление и оплату вашей квартиры или апартамента.</p>
                    <?/*<a class="btn btn--transp reservation-message__btn" href="/newbuild/" >
                            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 20 20" class="svg btn__ic ic-arrow inlined-svg lazyloaded" data-src="/local/templates/fsk/img/icons/ic-arrow.svg" width="20" height="20" role="img" aria-labelledby="title"><title>link</title><g transform="translate(0 20) rotate(-90)"><g transform="translate(20) rotate(90)" fill="none"><path d="M10,0A10,10,0,1,1,0,10,10,10,0,0,1,10,0Z" stroke="none"></path><path d="M 10.00000095367432 1.500001907348633 C 5.313080787658691 1.500001907348633 1.500001907348633 5.313080787658691 1.500001907348633 10.00000095367432 C 1.500001907348633 14.68692111968994 5.313080787658691 18.5 10.00000095367432 18.5 C 14.68692111968994 18.5 18.5 14.68692111968994 18.5 10.00000095367432 C 18.5 5.313080787658691 14.68692111968994 1.500001907348633 10.00000095367432 1.500001907348633 M 10.00000095367432 1.9073486328125e-06 C 15.52285099029541 1.9073486328125e-06 20 4.477150917053223 20 10.00000095367432 C 20 15.52285099029541 15.52285099029541 20 10.00000095367432 20 C 4.477150917053223 20 1.9073486328125e-06 15.52285099029541 1.9073486328125e-06 10.00000095367432 C 1.9073486328125e-06 4.477150917053223 4.477150917053223 1.9073486328125e-06 10.00000095367432 1.9073486328125e-06 Z" stroke="none"></path></g><g transform="translate(7.236 5.719)"><g transform="translate(5.504 5.4) rotate(90)"><g transform="translate(0 5.504) rotate(-90)"><path d="M0,0,2.752,2.752,5.5,0" fill="none" stroke-linecap="round" stroke-linejoin="round" stroke-miterlimit="10" stroke-width="1.5"></path></g></g><line y2="7.826" transform="translate(2.739)" fill="none" stroke-linecap="round" stroke-width="1.5"></line></g></g></svg>
                            Перейти в новостройки
                        </a>*/?>
                </div>
            </div>
            <div class="lk-items">
                <a href="/lk/" class="lk-items-card">
                    <div class="lk-items-card-info">
                        <div class="lk-items-card-info__title">
                            <img src="/local/templates/fsk/assets/src/images/lk-data-icon.svg" alt="Моя сделка">
                            Личный кабинет
                        </div>
                        <div class="lk-items-card-info__text">Следите за этапами сделки, загружайте документы, выпускайте электронную подпись: все онлайн!</div>
                        <div class="lk-items-card-info__btn btn-new btn--transp">
                            <svg width="20" height="21" viewBox="0 0 20 21" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M10 1.52344C5.03738 1.52344 1 5.56082 1 10.5234C1 15.4861 5.03738 19.5234 10 19.5234C14.9626 19.5234 19 15.4861 19 10.5234C19 5.56082 14.9626 1.52344 10 1.52344ZM10 0.523438C15.5228 0.523438 20 5.00059 20 10.5234C20 16.0463 15.5228 20.5234 10 20.5234C4.47715 20.5234 0 16.0463 0 10.5234C0 5.00059 4.47715 0.523438 10 0.523438Z" fill="#F35E41"></path><path d="M11.1191 13.2874L13.8711 10.5354L11.1191 7.78735" stroke="#F04B2F" stroke-miterlimit="10" stroke-linecap="round" stroke-linejoin="round"></path><path d="M5.71924 10.5483H13.5452" stroke="#F04B2F" stroke-linecap="round"></path></svg>
                            Перейти в кабинет
                        </div>
                    </div>
                    <div class="lk-items-card__img">
                        <img src="/local/templates/fsk/assets/src/images/auth.jpg" alt="Моя сделка" style="object-position: 15% center;">
                    </div>
                </a>
            </div>
        </div>
    </div>
</div>
<?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>
