<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetPageProperty("TITLE", "Пользовательское соглашение");
$APPLICATION->SetPageProperty("keywords", "Пользовательское соглашение");
$APPLICATION->SetPageProperty("description", "Пользовательское соглашение");
$APPLICATION->SetTitle("Пользовательское соглашение");
?><div class="page page--nohero">
	<div class="container">
		 <?$APPLICATION->IncludeComponent(
	"bitrix:breadcrumb",
	"main_breadcrumbs",
	Array(
		"PATH" => "",
		"SITE_ID" => "s1",
		"START_FROM" => "0"
	)
);?>
		<h1 class="title title-margin"><?=$APPLICATION->ShowTitle(false)?></h1>
		<p>
 <b>1. </b><b>Пользовательское соглашение</b>
		</p>
		<p>
		</p>
		Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между ООО ФСК Лидер Северо-запад (далее ГК ФСК Северо-запад или Администрация) с одной стороны и пользователем сайта с другой.<br>
		 Сайт ГК ФСК Северо-запад не является средством массовой информации.<br>
 <br>
		 Используя сайт, Вы соглашаетесь с условиями данного соглашения.<br>
		 Если Вы не согласны с условиями данного соглашения, не используйте сайт ГК ФСК Северо-запад!<br>
		<br>
 <b>Права и обязанности сторон </b><br>
		 Пользователь имеет право:<br>
		 - осуществлять поиск информации на сайте<br>
		 - получать информацию на сайте<br>
		 - копировать информацию на другие сайты с разрешения Администрации сайта<br>
 <br>
 <b>Администрация имеет право:</b><br>
		 - по своему усмотрению и необходимости создавать, изменять, отменять правила<br>
		 - ограничивать доступ к любой информации на сайте<br>
		 - создавать, изменять, удалять информацию<br>
 <br>
 <b>Пользователь обязуется:</b><br>
		 - обеспечивать сохранность личных данных от доступа третьих лиц<br>
		 - не нарушать работоспособность сайта<br>
		 - не передавать в пользование свою учетную запись и/или логин и пароль своей учетной записи третьим лицам<br>
		 - не регистрировать учетную запись от имени или вместо другого лица за исключением случаев, предусмотренных законодательством РФ<br>
		 - не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и его Сервисами<br>
 <br>
 <b>Администрация обязуется:</b><br>
		 - поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от Администрации причинам.<br>
		 - осуществлять разностороннюю защиту учетной записи Пользователя<br>
 <br>
		<b>Ответственность сторон </b><br>
		 - администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами<br>
		 - в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса<br>
		<br>
 <b>Условия действия Соглашения </b><br>
		 Данное Соглашение вступает в силу при любом использовании данного сайта.<br>
		 Соглашение перестает действовать при появлении его новой версии.<br>
		 Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.<br>
		 Администрация не оповещает пользователей об изменении в Соглашении.<br>
 <br>
 <br>
 <br>
 <br>
		<p style="text-align: center;">
		</p>
	</div>
	 <!-- /.container-->
</div>
 <br><?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>